In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\ideal info\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ideal info\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ideal info\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pandas) (2025.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\ideal info\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pandas) (2025.2)
Requirement already satisfied: numpy>=1.22.4 in c:\users\ideal info\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from pandas) (2.0.2)
Requirement already satisfied: six>=1.5 in c:\users\ideal info\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

WARNING: You are using pip version 22.0.4; however, version 25.1.1 is available.
You should consider upgrading via the 'C:\Users\IDEAL INFO\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.9_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip' command.

In [ ]:
import pandas as pd

In [ ]:
#a list of number 
numbers =[1,2,3,4,5]

In [ ]:
#create a series from the list . 
# series is a list with an index .   
#dtype: return the type of data our series is .
# our index is going to start at 0
pd.Series(numbers)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
#create a lis of char 
# we create this object , we can now enter it as a data point .
letters =["a","b","c","d","e"]

In [ ]:
# we have the letters as the data , and for the index we can insert the numbers. 
#we will have the data type as object since strings are considered objects .
# our index is going to start at 1 
#letters and numbers should be same lengths .
pd.Series(data=letters, index=numbers)

1    a
2    b
3    c
4    d
5    e
dtype: object

In [ ]:
#the type of data is object 
# i created an index with my personal labels , that will works as an index 
pd.Series(data=letters, index=['letter1 ','letter2' ,'letter3','letter4','letter5'])

letter1     a
letter2     b
letter3     c
letter4     d
letter5     e
dtype: object

In [20]:
# i created a dictionary of data 
data ={'name':'Luigi', 'age':26 , 'work':'employed'}

In [21]:
pd.Series(data=data)

name       Luigi
age           26
work    employed
dtype: object

In [22]:
numbers=[1,2,3,4,5] #  a list of numbers 
letters=['a','b','c','d','e'] # a list of letters

In [ ]:
# create a series  of number (list indexed )
# the data type is integer 
number_series =pd.Series(numbers)
number_series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
# create a series  of number (list indexed )
# the data type is object 
letter_series=pd.Series(letters)
letter_series #variable

0    a
1    b
2    c
3    d
4    e
dtype: object

In [ ]:
# the attribute dtype return the data type of that series  
number_series.dtype

dtype('int64')

In [ ]:
#the letter_series contains strings 
# in this step , dtype going to return 'o' which stand for object . 
letter_series.dtype

dtype('O')

In [ ]:
# the attribute .value will return an array of type object and it contains these strings 
letter_series.values

array(['a', 'b', 'c', 'd', 'e'], dtype=object)

In [32]:
number_series.values

array([1, 2, 3, 4, 5])

In [35]:
#.index returns information about the index 
#the rslt going to say that this is a range index since it starts from 0 and stops at 5 with a step of one 
letter_series.index

RangeIndex(start=0, stop=5, step=1)

In [42]:
# in this step we create onether series list which have a none value 
incomplete_series=pd.Series(data=['a','b',None] , index=[1,2,3])
incomplete_series

1       a
2       b
3    None
dtype: object

In [43]:
#the .hasnans attribute check if we have a none value in series list or no 
# if we have , will return true 
# if we don't have a none or null value will receive false 

incomplete_series.hasnans

True

In [ ]:
#.shape return the shape of series as a tuple (5 lines,1 column) , and usually we used with dataframes
# we got (5,) because it only has one column
number_series.shape

(5,)

In [ ]:
# .size return the size of the series 
#since it contains 5 elements, it's going to return 5 
number_series.size

5

In [50]:
#we need to know the size of letter series  
letter_series.size

5

In [52]:
#we use the methods 
values= pd.Series(data=[1.5, 2.5, 0.5, None, 4.0, 1.0])

In [ ]:
# the method .max() return the maximum value in this list 
values.max()

np.float64(4.0)

In [55]:
# the method .min() return the mainimum value in this list 
values.min()

np.float64(0.5)

In [57]:
# the method .sum() return the sum of  this values 
values.sum()

np.float64(9.5)

In [58]:
 # the method .mean () return the average  in this list 
values.mean()

np.float64(1.9)

In [61]:
# .idxmax() get the index of the max value of the series 
values.idxmax()

4

In [ ]:
# .idxmax() get the index of the max value of the series 
# NB : index start from 0 
values.idxmin()

2

In [ ]:
# .isnull return  wich value is null 
# the third value in this series is  null 
#the type pf result is boolean , True or False 
values.isnull()

0    False
1    False
2    False
3     True
4    False
5    False
dtype: bool

In [ ]:
#.round() each value in the series 
#round the decimals 
values.round()

0    1.5
1    2.5
2    0.5
3    NaN
4    4.0
5    1.0
dtype: float64

In [85]:
#how we read a csv file 
#riches is a variable and  we're calling a pd.read csv as the first argument is the path to csv file , usecols means which column you need ,
#  .squeeze() that's mean convert this column to a series (list indexed) .
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Name']).squeeze()
richest

0                     Elon Musk
1                    Jeff Bezos
2      Bernard Arnault & family
3                    Bill Gates
4                Warren Buffett
                 ...
96             Vladimir Potanin
97         Harold Hamm & family
98                 Sun Piaoyang
99           Luo Liguo & family
100                   Peter Woo
Name: Name, Length: 101, dtype: object

In [84]:
type(richest)

pandas.core.series.Series

In [90]:
#create  another csv files named test.csv
#we eliminate the index column with index=False 
richest.to_csv('test.csv', index=False )

In [97]:
#squeeze() is just to convert to indexed list(series list )
name_of_people= pd.read_csv('test.csv').squeeze()
name_of_people

0                     Elon Musk
1                    Jeff Bezos
2      Bernard Arnault & family
3                    Bill Gates
4                Warren Buffett
                 ...
96             Vladimir Potanin
97         Harold Hamm & family
98                 Sun Piaoyang
99           Luo Liguo & family
100                   Peter Woo
Name: Name, Length: 101, dtype: object

In [99]:
#we need to know the type of object name_of_people 
#if we eliminate .squeez() in the last query, we got a dataframe as a type of name_of_people 
type(name_of_people)

pandas.core.series.Series

In [ ]:
#read a csv file 
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv')
richest

,Name,NetWorth,Age,Country/Territory,Source,Industry
0,Elon Musk,"$219,000,000,000",50,United States,"Tesla, SpaceX",Automotive
1,Jeff Bezos,"$171,000,000,000",58,United States,Amazon,Technology
2,Bernard Arnault & family,"$158,000,000,000",73,France,LVMH,Fashion & Retail
3,Bill Gates,"$129,000,000,000",66,United States,Microsoft,Technology
4,Warren Buffett,"$118,000,000,000",91,United States,Berkshire Hathaway,Finance & Investments
...,...,...,...,...,...,...
96,Vladimir Potanin,"$17,300,000,000",61,Russia,metals,Metals & Mining
97,Harold Hamm & family,"$17,200,000,000",76,United States,oil & gas,Energy
98,Sun Piaoyang,"$17,100,000,000",63,China,pharmaceuticals,Healthcare
99,Luo Liguo & family,"$17,000,000,000",66,China,chemicals,Manufacturing
100,Peter Woo,"$17,000,000,000",75,Hong Kong,real estate,Real Estate

In [ ]:
#variable.head(10) return the 10 first rows (10 excluded )
richest.head(10)

,Name,NetWorth,Age,Country/Territory,Source,Industry
0,Elon Musk,"$219,000,000,000",50,United States,"Tesla, SpaceX",Automotive
1,Jeff Bezos,"$171,000,000,000",58,United States,Amazon,Technology
2,Bernard Arnault & family,"$158,000,000,000",73,France,LVMH,Fashion & Retail
3,Bill Gates,"$129,000,000,000",66,United States,Microsoft,Technology
4,Warren Buffett,"$118,000,000,000",91,United States,Berkshire Hathaway,Finance & Investments
5,Larry Page,"$111,000,000,000",49,United States,Google,Technology
6,Sergey Brin,"$107,000,000,000",48,United States,Google,Technology
7,Larry Ellison,"$106,000,000,000",77,United States,software,Technology
8,Steve Ballmer,"$91,400,000,000",66,United States,Microsoft,Technology
9,Mukesh Ambani,"$90,700,000,000",64,India,diversified,Diversified

In [ ]:


#variable.head(-10) , eliminate the 10 final rows : we are missing 10 rows ;
richest.head(-10)

,Name,NetWorth,Age,Country/Territory,Source,Industry
0,Elon Musk,"$219,000,000,000",50,United States,"Tesla, SpaceX",Automotive
1,Jeff Bezos,"$171,000,000,000",58,United States,Amazon,Technology
2,Bernard Arnault & family,"$158,000,000,000",73,France,LVMH,Fashion & Retail
3,Bill Gates,"$129,000,000,000",66,United States,Microsoft,Technology
4,Warren Buffett,"$118,000,000,000",91,United States,Berkshire Hathaway,Finance & Investments
...,...,...,...,...,...,...
86,Vladimir Lisin,"$18,400,000,000",65,Russia,"steel, transport",Metals & Mining
87,Fan Hongwei & family,"$18,200,000,000",55,China,petrochemicals,Energy
88,Lakshmi Mittal,"$17,900,000,000",71,India,steel,Metals & Mining
89,Andrew Forrest,"$17,800,000,000",60,Australia,mining,Metals & Mining
90,Jiang Rensheng & family,"$17,700,000,000",68,China,vaccines,Healthcare

In [ ]:
#.tail(10) : return the last 10 rows from our dataset 
richest.tail(10)

,Name,NetWorth,Age,Country/Territory,Source,Industry
91,Savitri Jindal & family,"$17,700,000,000",72,India,steel,Metals & Mining
92,Wang Wenyin,"$17,700,000,000",54,China,"mining, copper products",Metals & Mining
93,Li Xiting,"$17,600,000,000",71,Singapore,medical devices,Healthcare
94,Stefan Persson,"$17,600,000,000",74,Sweden,H&M,Fashion & Retail
95,Steve Cohen,"$17,400,000,000",65,United States,hedge funds,Finance & Investments
96,Vladimir Potanin,"$17,300,000,000",61,Russia,metals,Metals & Mining
97,Harold Hamm & family,"$17,200,000,000",76,United States,oil & gas,Energy
98,Sun Piaoyang,"$17,100,000,000",63,China,pharmaceuticals,Healthcare
99,Luo Liguo & family,"$17,000,000,000",66,China,chemicals,Manufacturing
100,Peter Woo,"$17,000,000,000",75,Hong Kong,real estate,Real Estate

In [110]:
#.tail(-10) : eliminate the  first 10 rows from our dataset 
# we exclude the 10 first element 
richest.tail(-10)

,Name,NetWorth,Age,Country/Territory,Source,Industry
10,Gautam Adani & family,"$90,000,000,000",59,India,"infrastructure, commodities",Diversified
11,Michael Bloomberg,"$82,000,000,000",80,United States,Bloomberg LP,Media & Entertainment
12,Carlos Slim Helu & family,"$81,200,000,000",82,Mexico,telecom,Telecom
13,Francoise Bettencourt Meyers & family,"$74,800,000,000",68,France,L'Oréal,Fashion & Retail
14,Mark Zuckerberg,"$67,300,000,000",37,United States,Facebook,Technology
...,...,...,...,...,...,...
96,Vladimir Potanin,"$17,300,000,000",61,Russia,metals,Metals & Mining
97,Harold Hamm & family,"$17,200,000,000",76,United States,oil & gas,Energy
98,Sun Piaoyang,"$17,100,000,000",63,China,pharmaceuticals,Healthcare
99,Luo Liguo & family,"$17,000,000,000",66,China,chemicals,Manufacturing
100,Peter Woo,"$17,000,000,000",75,Hong Kong,real estate,Real Estate

In [ ]:
#just for reading a csv file and we choice the column of names such as a series 
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Name']).squeeze()
richest

0                     Elon Musk
1                    Jeff Bezos
2      Bernard Arnault & family
3                    Bill Gates
4                Warren Buffett
                 ...
96             Vladimir Potanin
97         Harold Hamm & family
98                 Sun Piaoyang
99           Luo Liguo & family
100                   Peter Woo
Name: Name, Length: 101, dtype: object

In [126]:
# is used for dataframes because dataframes have two axes , axis by default =0 , then we choce to sort it ascending order .
#kind of algorithme it should use for sorting 
#na_position : the null values we can placed in last or first 
# with ignore_index we can eliminate the index for exmpl '74' for the abigail and will be the first with 0 index  
richest.sort_values(axis=0,  ascending=True , kind='quicksort' , na_position='last', ignore_index=True )

0           Abigail Johnson
1          Alain Wertheimer
2              Alice Walton
3            Amancio Ortega
4            Andrew Forrest
               ...
96           Warren Buffett
97         William Lei Ding
98     Yang Huiyan & family
99             Zhang Yiming
100          Zhong Shanshan
Name: Name, Length: 101, dtype: object

In [128]:
#we sort the data from his index in the ascending order 
richest.sort_index(ascending=False )

100          Zhong Shanshan
99             Zhang Yiming
98     Yang Huiyan & family
97         William Lei Ding
96           Warren Buffett
               ...
4            Andrew Forrest
3            Amancio Ortega
2              Alice Walton
1          Alain Wertheimer
0           Abigail Johnson
Name: Name, Length: 101, dtype: object

In [ ]:
#just for reading a csv file and we choice the column of industry  such as a series 
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Industry']).squeeze()
richest

0                 Automotive
1                 Technology
2           Fashion & Retail
3                 Technology
4      Finance & Investments
               ...
96           Metals & Mining
97                    Energy
98                Healthcare
99             Manufacturing
100              Real Estate
Name: Industry, Length: 101, dtype: object

In [ ]:
#in this step .value_counts() going to count each one of the values in column industry because we have a lot of different industries and 
#some are repeating , So the most common or the most repeated industry is the fashion & retail, and that occurred 18 times ...
#sort=true : from the highest frequency to the lowest frequency 
#we can use dropona=True , if we have anything not a number , it's going to drop those . 
richest.value_counts(sort=True)

Industry
Fashion & Retail         18
Technology               15
Finance & Investments    13
Metals & Mining           9
Food & Beverage           8
Automotive                7
Diversified               6
Manufacturing             5
Healthcare                5
Media & Entertainment     4
Real Estate               3
Telecom                   2
Logistics                 2
Energy                    2
Gambling & Casinos        1
Service                   1
Name: count, dtype: int64

In [ ]:
#just for reading a csv file and we choice the column of age such as a series 
#we have all the ages in our database 
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Age']).squeeze()
richest

0      50
1      58
2      73
3      66
4      91
       ..
96     61
97     76
98     63
99     66
100    75
Name: Age, Length: 101, dtype: int64

In [150]:
#.value_counts(bins=5) that's means we're going to get  five bins back . And essentially it created groups for us . 
#for exemple there are 5 people within the age group of 29.9 to 42.8 
# and we have 17 people in the range of 42.8 to 55.6 ...
#but that only works with numerical data 

richest.value_counts(bins=5)

(55.6, 68.4]      33
(68.4, 81.2]      27
(81.2, 94.0]      19
(42.8, 55.6]      17
(29.935, 42.8]     5
Name: count, dtype: int64

In [151]:
#just for reading a csv file and we choice the column of name such as a series 
#we have all the names  in our database 
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Name']).squeeze()
richest

0                     Elon Musk
1                    Jeff Bezos
2      Bernard Arnault & family
3                    Bill Gates
4                Warren Buffett
                 ...
96             Vladimir Potanin
97         Harold Hamm & family
98                 Sun Piaoyang
99           Luo Liguo & family
100                   Peter Woo
Name: Name, Length: 101, dtype: object

In [ ]:
#get the first 10 elements(names) 
richest.head(10)

0                   Elon Musk
1                  Jeff Bezos
2    Bernard Arnault & family
3                  Bill Gates
4              Warren Buffett
5                  Larry Page
6                 Sergey Brin
7               Larry Ellison
8               Steve Ballmer
9               Mukesh Ambani
Name: Name, dtype: object

In [161]:
#go to access the  element(name) number 10 for exemple .
#accessing an element via its exact position (what you need to know) 
richest[10]

'Gautam Adani & family'

In [159]:
#accessing mulpitle elements with a list of position 
richest[[1,2,15]]

1                   Jeff Bezos
2     Bernard Arnault & family
15                  Jim Walton
Name: Name, dtype: object

In [ ]:
#accessing via slicing .
#you can select from the position 5 for exemple under the position 11 excluded -> you will receive from the 5 position under the 10 position names 
richest[5:11]

5                Larry Page
6               Sergey Brin
7             Larry Ellison
8             Steve Ballmer
9             Mukesh Ambani
10    Gautam Adani & family
Name: Name, dtype: object

In [ ]:
#accessing via slicing with a step 
#you will receive from the position 0 to te position 21 excluded , with 5 step 
richest[0:21:5]

0                 Elon Musk
5                Larry Page
10    Gautam Adani & family
15               Jim Walton
20             Charles Koch
Name: Name, dtype: object

In [ ]:
#accessing evething until 10 (excluded)
richest[:10]

0                   Elon Musk
1                  Jeff Bezos
2    Bernard Arnault & family
3                  Bill Gates
4              Warren Buffett
5                  Larry Page
6                 Sergey Brin
7               Larry Ellison
8               Steve Ballmer
9               Mukesh Ambani
Name: Name, dtype: object

In [170]:
#you muust ceate a list [1,2,3] , and the n [-1] represente , they can get the last element in this list 
[1,2,3][-1]

3

In [ ]:
#get the last element (name) 
# in our database 
richest[-1:]

100    Peter Woo
Name: Name, dtype: object

In [ ]:
#you  can know how our database is indexed , start from 0 to 101 with 1 step 
richest.index

RangeIndex(start=0, stop=101, step=1)

In [ ]:
#just for reading a csv file and we choice 2 column , name and networks  such as a series 
#we're going to have a new series that uses the names as the key and the networth as the values 
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Name','NetWorth'], index_col='Name').squeeze()
richest

Name
Elon Musk                   $219,000,000,000
Jeff Bezos                  $171,000,000,000
Bernard Arnault & family    $158,000,000,000
Bill Gates                  $129,000,000,000
Warren Buffett              $118,000,000,000
                                  ...
Vladimir Potanin             $17,300,000,000
Harold Hamm & family         $17,200,000,000
Sun Piaoyang                 $17,100,000,000
Luo Liguo & family           $17,000,000,000
Peter Woo                    $17,000,000,000
Name: NetWorth, Length: 101, dtype: object

In [182]:
richest[0]

C:\Users\IDEAL INFO\AppData\Local\Temp\ipykernel_22260\3734245380.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  richest[0]

'$219,000,000,000'

In [ ]:
#accessing a single element indexed bill gates , and we got the networth of this index 
richest['Bill Gates']

'$129,000,000,000'

In [ ]:
#accessing multiple element 
#accessing to 2 element 

richest[['Bill Gates','Warren Buffett']]

Name
Bill Gates        $129,000,000,000
Warren Buffett    $118,000,000,000
Name: NetWorth, dtype: object

In [ ]:
#slicing via index 
#we want to find out what's between Bill Gates and Steve Ballmer 
richest['Bill Gates':'Steve Ballmer']

Name
Bill Gates        $129,000,000,000
Warren Buffett    $118,000,000,000
Larry Page        $111,000,000,000
Sergey Brin       $107,000,000,000
Larry Ellison     $106,000,000,000
Steve Ballmer      $91,400,000,000
Name: NetWorth, dtype: object

In [187]:
#will still give us 2 elements back Elon and Jeff   
richest [0:2]

Name
Elon Musk     $219,000,000,000
Jeff Bezos    $171,000,000,000
Name: NetWorth, dtype: object

In [ ]:
#.index , give you all the index are used ( much larger indexer are used in this situation is names )
richest.index

Index(['Elon Musk', 'Jeff Bezos', 'Bernard Arnault & family', 'Bill Gates',
       'Warren Buffett', 'Larry Page', 'Sergey Brin', 'Larry Ellison',
       'Steve Ballmer', 'Mukesh Ambani',
       ...
       'Savitri Jindal & family', 'Wang Wenyin', 'Li Xiting', 'Stefan Persson',
       'Steve Cohen', 'Vladimir Potanin', 'Harold Hamm & family',
       'Sun Piaoyang', 'Luo Liguo & family', 'Peter Woo'],
      dtype='object', name='Name', length=101)

In [208]:
richest=pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv',usecols=['Name','Age'], index_col='Name').squeeze()
richest

Name
Elon Musk                   50
Jeff Bezos                  58
Bernard Arnault & family    73
Bill Gates                  66
Warren Buffett              91
                            ..
Vladimir Potanin            61
Harold Hamm & family        76
Sun Piaoyang                63
Luo Liguo & family          66
Peter Woo                   75
Name: Age, Length: 101, dtype: int64

In [194]:
#find wich person is the oldest
oldest= richest.idxmax() 
oldest

'Lee Shau Kee'

In [196]:
#how old is he 
richest[oldest]

np.int64(94)

In [ ]:
#sor the values from the oldest to youngest age to verify 
x=richest.sort_values( ascending=False ) 
x

Name
Lee Shau Kee               94
Li Ka-shing                93
Warren Buffett             91
Rupert Murdoch & family    91
Leonard Lauder             89
                           ..
Yang Huiyan & family       40
Guillaume Pousaz           40
Zhang Yiming               38
Mark Zuckerberg            37
Sam Bankman-Fried          30
Name: Age, Length: 101, dtype: int64

In [ ]:
#which person is the youngest 
youngest=richest.idxmin()
youngest

'Sam Bankman-Fried'

In [ ]:
# how young is the youngest 
richest[youngest]

np.int64(30)

In [ ]:
#the AVG age of all ( round it oo 2 decimal places )
richest.mean().round(2)

np.float64(67.12)

In [225]:
#save the series as a csv file named : sample.csv 
richest.to_csv('sample.csv')

In [228]:
# read the csv you just saved 
pd.read_csv('sample.csv')

                     Name  Age
0          Zhong Shanshan   67
1            Zhang Yiming   38
2    Yang Huiyan & family   40
3        William Lei Ding   50
4          Warren Buffett   91
..                    ...  ...
96         Andrew Forrest   60
97         Amancio Ortega   86
98           Alice Walton   72
99       Alain Wertheimer   73
100       Abigail Johnson   60

[101 rows x 2 columns]

In [230]:
#we create a data 
#we have 3 elements here and we have some nested lists . We have a disctionary with lists inside
#we use dataframe priùarily for efficient and organized handling of tabular data .
data={'a':[100,200,300], 'b':[400,500,600],'c':[700,800,900]}
df= pd.DataFrame(data=data)
df

     a    b    c
0  100  400  700
1  200  500  800
2  300  600  900

In [ ]:
#return to us a series 
df['a']

0    100
1    200
2    300
Name: a, dtype: int64

In [236]:
#How to create a dataframe with onether solution , indexed by first, second , third ; and named by a , b and c 
# a bit more personalized 
df= pd.DataFrame(data=[[100,200,300] , [400,500,600] , [700,800,900 ]] , 
                   index =['First','second','Third '] , 
                   columns=['a','b','c'] )
df

          a    b    c
First   100  200  300
second  400  500  600
Third   700  800  900

In [235]:
df['a']

First     100
second    400
Third     700
Name: a, dtype: int64

In [239]:
df.c

First     300
second    600
Third     900
Name: c, dtype: int64

In [241]:
richest= pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\TopRichestInWorld.csv')
richest

,Name,NetWorth,Age,Country/Territory,Source,Industry
0,Elon Musk,"$219,000,000,000",50,United States,"Tesla, SpaceX",Automotive
1,Jeff Bezos,"$171,000,000,000",58,United States,Amazon,Technology
2,Bernard Arnault & family,"$158,000,000,000",73,France,LVMH,Fashion & Retail
3,Bill Gates,"$129,000,000,000",66,United States,Microsoft,Technology
4,Warren Buffett,"$118,000,000,000",91,United States,Berkshire Hathaway,Finance & Investments
...,...,...,...,...,...,...
96,Vladimir Potanin,"$17,300,000,000",61,Russia,metals,Metals & Mining
97,Harold Hamm & family,"$17,200,000,000",76,United States,oil & gas,Energy
98,Sun Piaoyang,"$17,100,000,000",63,China,pharmaceuticals,Healthcare
99,Luo Liguo & family,"$17,000,000,000",66,China,chemicals,Manufacturing
100,Peter Woo,"$17,000,000,000",75,Hong Kong,real estate,Real Estate

In [ ]:
#.shape return to us that it has 101 rows and 6 columns 
richest.shape

(101, 6)

In [245]:
#return how many element in this dataframe 
richest.size

606

In [247]:
#we can get some information regarding the index and it's a simple range that start from 0 to 101 with 1 step 
richest.index

RangeIndex(start=0, stop=101, step=1)

In [ ]:
#we can also see what kind of columns we have  . it's going to give us all the column and the datatype = object because they are strings 
richest.columns

Index(['Name', 'NetWorth', 'Age', 'Country/Territory', 'Source', 'Industry'], dtype='object')

In [252]:
#that's going to return to us information regarding both the index and the columns .
richest.axes

[RangeIndex(start=0, stop=101, step=1),
 Index(['Name', 'NetWorth', 'Age', 'Country/Territory', 'Source', 'Industry'], dtype='object')]

In [ ]:
#we can also get the data types for each one of the columns 
richest.dtypes

Name                 object
NetWorth             object
Age                   int64
Country/Territory    object
Source               object
Industry             object
dtype: object

In [ ]:
#we can also get some information regarding the values 
#going to return to us all the values in our dataframe as an array 
richest.values

array([['Elon Musk', '$219,000,000,000', 50, 'United States',
        'Tesla, SpaceX', 'Automotive'],
       ['Jeff Bezos', '$171,000,000,000', 58, 'United States', 'Amazon',
        'Technology'],
       ['Bernard Arnault & family', '$158,000,000,000', 73, 'France',
        'LVMH', 'Fashion & Retail'],
       ['Bill Gates', '$129,000,000,000', 66, 'United States',
        'Microsoft', 'Technology'],
       ['Warren Buffett', '$118,000,000,000', 91, 'United States',
        'Berkshire Hathaway', 'Finance & Investments'],
       ['Larry Page', '$111,000,000,000', 49, 'United States', 'Google',
        'Technology'],
       ['Sergey Brin', '$107,000,000,000', 48, 'United States', 'Google',
        'Technology'],
       ['Larry Ellison', '$106,000,000,000', 77, 'United States',
        'software', 'Technology'],
       ['Steve Ballmer', '$91,400,000,000', 66, 'United States',
        'Microsoft', 'Technology'],
       ['Mukesh Ambani', '$90,700,000,000', 64, 'India', 'diversified',
        'Diversified'],
       ['Gautam Adani & family', '$90,000,000,000', 59, 'India',
        'infrastructure, commodities', 'Diversified'],
       ['Michael Bloomberg', '$82,000,000,000', 80, 'United States',
        'Bloomberg LP', 'Media & Entertainment'],
       ['Carlos Slim Helu & family', '$81,200,000,000', 82, 'Mexico',
        'telecom', 'Telecom'],
       ['Francoise Bettencourt Meyers & family', '$74,800,000,000', 68,
        'France', "L'Oréal", 'Fashion & Retail'],
       ['Mark Zuckerberg', '$67,300,000,000', 37, 'United States',
        'Facebook', 'Technology'],
       ['Jim Walton', '$66,200,000,000', 73, 'United States', 'Walmart',
        'Fashion & Retail'],
       ['Zhong Shanshan', '$65,700,000,000', 67, 'China',
        'beverages, pharmaceuticals', 'Food & Beverage'],
       ['Alice Walton', '$65,300,000,000', 72, 'United States',
        'Walmart', 'Fashion & Retail'],
       ['Rob Walton', '$65,000,000,000', 77, 'United States', 'Walmart',
        'Fashion & Retail'],
       ['Changpeng Zhao', '$65,000,000,000', 44, 'Canada',
        'cryptocurrency exchange', 'Finance & Investments'],
       ['Charles Koch', '$60,000,000,000', 86, 'United States',
        'Koch Industries', 'Diversified'],
       ['Julia Koch & family', '$60,000,000,000', 59, 'United States',
        'Koch Industries', 'Diversified'],
       ['Amancio Ortega', '$59,600,000,000', 86, 'Spain', 'Zara',
        'Fashion & Retail'],
       ['Michael Dell', '$55,100,000,000', 57, 'United States',
        'Dell computers', 'Technology'],
       ['Zhang Yiming', '$50,000,000,000', 38, 'China', 'TikTok',
        'Media & Entertainment'],
       ['David Thomson & family', '$49,200,000,000', 64, 'Canada',
        'media', 'Media & Entertainment'],
       ['Phil Knight & family', '$47,300,000,000', 84, 'United States',
        'Nike', 'Fashion & Retail'],
       ['Dieter Schwarz', '$47,100,000,000', 82, 'Germany', 'retail',
        'Fashion & Retail'],
       ['Robin Zeng', '$44,800,000,000', 53, 'Hong Kong', 'batteries',
        'Automotive'],
       ['MacKenzie Scott', '$43,600,000,000', 51, 'United States',
        'Amazon', 'Technology'],
       ['Rodolphe Saadé & family', '$41,400,000,000', 52, 'France',
        'shipping', 'Logistics'],
       ['François Pinault & family', '$40,400,000,000', 85, 'France',
        'luxury goods', 'Fashion & Retail'],
       ['Klaus-Michael Kuehne', '$37,300,000,000', 84, 'Germany',
        'shipping', 'Logistics'],
       ['Ma Huateng', '$37,200,000,000', 50, 'China', 'internet media',
        'Technology'],
       ['Beate Heister & Karl Albrecht Jr. & family', '$36,800,000,000',
        50, 'Germany', 'supermarkets', 'Fashion & Retail'],
       ['Giovanni Ferrero', '$36,200,000,000', 57, 'Italy',
        'Nutella, chocolates', 'Food & Beverage'],
       ['Li Ka-shing', '$34,800,000,000', 93, 'Hong Kong', 'diversified',
        'Diversified'],
       ['Stephen Schwarzman', '$34,800,000,000', 75, 'United States',
        'investments', 'Finance & Investments'],
       ['Lee Shau Kee', '$32,600,000,000', 94, 'Hong Kong',
        'real estate', 'Real Estate'],
       ['Len Blavatnik', '$32,500,000,000', 64, 'United States',
        'music, chemicals', 'Diversified'],
       ['Jacqueline Mars', '$31,700,000,000', 82, 'United States',
        'candy, pet food', 'Food & Beverage'],
       ['John Mars', '$31,700,000,000', 86, 'United States',
        'candy, pet food', 'Food & Beverage'],
       ['Alain Wertheimer', '$31,200,000,000', 73, 'France', 'Chanel',
        'Fashion & Retail'],
       ['Gerard Wertheimer', '$31,200,000,000', 71, 'France', 'Chanel',
        'Fashion & Retail'],
       ['German Larrea Mota Velasco & family', '$30,800,000,000', 68,
        'Mexico', 'mining', 'Metals & Mining'],
       ['Gina Rinehart', '$30,200,000,000', 68, 'Australia', 'mining',
        'Metals & Mining'],
       ['Shiv Nadar', '$28,700,000,000', 76, 'India',
        'software services', 'Technology'],
       ['Jim Simons', '$28,600,000,000', 83, 'United States',
        'hedge funds', 'Finance & Investments'],
       ['He Xiangjian', '$28,300,000,000', 79, 'China',
        'home appliances', 'Manufacturing'],
       ['Miriam Adelson', '$27,500,000,000', 76, 'United States',
        'casinos', 'Gambling & Casinos'],
       ['Dietrich Mateschitz', '$27,400,000,000', 77, 'Austria',
        'Red Bull', 'Food & Beverage'],
       ['Leonardo Del Vecchio & family', '$27,300,000,000', 86, 'Italy',
        'eyeglasses', 'Fashion & Retail'],
       ['Ken Griffin', '$27,200,000,000', 53, 'United States',
        'hedge funds', 'Finance & Investments'],
       ['Tadashi Yanai & family', '$26,100,000,000', 73, 'Japan',
        'fashion retail', 'Fashion & Retail'],
       ['William Lei Ding', '$25,200,000,000', 50, 'China',
        'online games', 'Technology'],
       ['Susanne Klatten', '$24,300,000,000', 59, 'Germany',
        'BMW, pharmaceuticals', 'Automotive'],
       ['Cyrus Poonawalla', '$24,300,000,000', 80, 'India', 'vaccines',
        'Healthcare'],
       ['Wang Wei', '$24,300,000,000', 51, 'China', 'package delivery',
        'Service'],
       ['Qin Yinglin', '$24,100,000,000', 56, 'China', 'pig breeding',
        'Food & Beverage'],
       ['Sam Bankman-Fried', '$24,000,000,000', 30, 'United States',
        'cryptocurrency exchange', 'Finance & Investments'],
       ['Takemitsu Takizaki', '$23,900,000,000', 76, 'Japan', 'sensors',
        'Manufacturing'],
       ['Li Shufu', '$23,700,000,000', 58, 'China', 'automobiles',
        'Automotive'],
       ['Emmanuel Besnier', '$23,500,000,000', 51, 'France', 'cheese',
        'Food & Beverage'],
       ['R. Budi Hartono', '$23,200,000,000', 81, 'Indonesia',
        'banking, tobacco', 'Finance & Investments'],
       ['Leonard Lauder', '$23,100,000,000', 89, 'United States',
        'Estee Lauder', 'Fashion & Retail'],
       ['Guillaume Pousaz', '$23,000,000,000', 40, 'Switzerland',
        'fintech', 'Finance & Investments'],
       ['Iris Fontbona & family', '$22,800,000,000', 79, 'Chile',
        'mining', 'Metals & Mining'],
       ['Jack Ma', '$22,800,000,000', 57, 'China', 'e-commerce',
        'Technology'],
       ['Michael Hartono', '$22,300,000,000', 82, 'Indonesia',
        'banking, tobacco', 'Manufacturing'],
       ['Eric Schmidt', '$22,100,000,000', 66, 'United States', 'Google',
        'Technology'],
       ['Ray Dalio', '$22,000,000,000', 72, 'United States',
        'hedge funds', 'Finance & Investments'],
       ['Daniel Gilbert', '$22,000,000,000', 60, 'United States',
        'Quicken Loans', 'Finance & Investments'],
       ['Thomas Frist, Jr. & family', '$21,800,000,000', 83,
        'United States', 'hospitals', 'Healthcare'],
       ['Masayoshi Son', '$21,300,000,000', 64, 'Japan',
        'internet, telecom', 'Telecom'],
       ['Abigail Johnson', '$21,200,000,000', 60, 'United States',
        'money management', 'Finance & Investments'],
       ['Rupert Murdoch & family', '$20,800,000,000', 91,
        'United States', 'newspapers, TV network',
        'Media & Entertainment'],
       ['Stefan Quandt', '$20,700,000,000', 55, 'Germany', 'BMW',
        'Automotive'],
       ['Jensen Huang', '$20,600,000,000', 59, 'United States',
        'semiconductors', 'Technology'],
       ['Huang Shilin', '$20,300,000,000', 55, 'China', 'batteries',
        'Automotive'],
       ['Thomas Peterffy', '$20,100,000,000', 77, 'United States',
        'discount brokerage', 'Finance & Investments'],
       ['Radhakishan Damani', '$20,000,000,000', 67, 'India',
        'retail, investments', 'Fashion & Retail'],
       ['Pang Kang', '$19,600,000,000', 66, 'China', 'soy sauce',
        'Food & Beverage'],
       ['Wang Chuanfu', '$19,500,000,000', 56, 'China',
        'batteries, automobiles', 'Automotive'],
       ['Reinhold Wuerth & family', '$19,000,000,000', 86, 'Germany',
        'fasteners', 'Manufacturing'],
       ['Theo Albrecht, Jr. & family', '$18,700,000,000', 71, 'Germany',
        "Aldi, Trader Joe's", 'Fashion & Retail'],
       ['Yang Huiyan & family', '$18,700,000,000', 40, 'China',
        'real estate', 'Real Estate'],
       ['Vladimir Lisin', '$18,400,000,000', 65, 'Russia',
        'steel, transport', 'Metals & Mining'],
       ['Fan Hongwei & family', '$18,200,000,000', 55, 'China',
        'petrochemicals', 'Energy'],
       ['Lakshmi Mittal', '$17,900,000,000', 71, 'India', 'steel',
        'Metals & Mining'],
       ['Andrew Forrest', '$17,800,000,000', 60, 'Australia', 'mining',
        'Metals & Mining'],
       ['Jiang Rensheng & family', '$17,700,000,000', 68, 'China',
        'vaccines', 'Healthcare'],
       ['Savitri Jindal & family', '$17,700,000,000', 72, 'India',
        'steel', 'Metals & Mining'],
       ['Wang Wenyin', '$17,700,000,000', 54, 'China',
        'mining, copper products', 'Metals & Mining'],
       ['Li Xiting', '$17,600,000,000', 71, 'Singapore',
        'medical devices', 'Healthcare'],
       ['Stefan Persson', '$17,600,000,000', 74, 'Sweden', 'H&M',
        'Fashion & Retail'],
       ['Steve Cohen', '$17,400,000,000', 65, 'United States',
        'hedge funds', 'Finance & Investments'],
       ['Vladimir Potanin', '$17,300,000,000', 61, 'Russia', 'metals',
        'Metals & Mining'],
       ['Harold Hamm & family', '$17,200,000,000', 76, 'United States',
        'oil & gas', 'Energy'],
       ['Sun Piaoyang', '$17,100,000,000', 63, 'China',
        'pharmaceuticals', 'Healthcare'],
       ['Luo Liguo & family', '$17,000,000,000', 66, 'China',
        'chemicals', 'Manufacturing'],
       ['Peter Woo', '$17,000,000,000', 75, 'Hong Kong', 'real estate',
        'Real Estate']], dtype=object)

In [260]:
import pandas as pd

In [262]:
series = pd.Series( [100,200,300] )
series

0    100
1    200
2    300
dtype: int64

In [ ]:
#we create our data and our dataframe is df 
data= {'a':[100,200,300], 'b':[400,500,600], 'c':[700,800,900]}
df= pd.DataFrame(data)
df

     a    b    c
0  100  400  700
1  200  500  800
2  300  600  900

In [ ]:
#sums each value per column and return a series 
# we can write axis=0 
df.sum()

a     600
b    1500
c    2400
dtype: int64

In [ ]:
#will sum thing up horizontaly (columns) 
#or we can write axis=1 
df.sum(axis='columns')

0    1200
1    1500
2    1800
dtype: int64

In [ ]:
#we just import the data set path 
dataset=r'C:\Users\IDEAL INFO\Documents\data_pipelines\imdb_top_1000.csv'

In [273]:
import pandas as pd

In [285]:
#specify the columns we want 
cols= ['Series_Title', 'IMDB_Rating', 'No_of_Votes', 'Gross', 'Released_Year','Genre']

In [287]:
#read the dataset  and i specified which columns i need 
movies= pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\imdb_top_1000.csv' , usecols = cols) 
movies

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,"28,341,469"
1,The Godfather,1972,"Crime, Drama",9.2,1620367,"134,966,411"
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,"534,858,444"
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,"57,300,000"
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,"4,360,000"
...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,NaN
996,Giant,1956,"Drama, Western",7.6,34075,NaN
997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,"30,500,000"
998,Lifeboat,1944,"Drama, War",7.6,26471,NaN
999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,NaN

In [ ]:
#gives us a lod of information / types/ whether we're missing values/ shows us the memory usage .. 
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Series_Title   1000 non-null   object
 1   Released_Year  1000 non-null   object
 2   Genre          1000 non-null   object
 3   IMDB_Rating    1000 non-null   float64
 4   No_of_Votes    1000 non-null   int64
 5   Gross          831 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 47.0+ KB

In [ ]:
#just for numerical type ,for exemple the gros is defined as object , so that's why is no included 
movies.describe().round()

       IMDB_Rating  No_of_Votes
count       1000.0       1000.0
mean           8.0     273693.0
std            0.0     327373.0
min            8.0      25088.0
25%            8.0      55526.0
50%            8.0     138548.0
75%            8.0     374161.0
max            9.0    2343110.0

In [ ]:
#replace each comma with nothing 
movies['Gross'] = movies ['Gross'].str.replace(',','')
movies

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,28341469
1,The Godfather,1972,"Crime, Drama",9.2,1620367,134966411
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,534858444
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,57300000
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,4360000
...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,NaN
996,Giant,1956,"Drama, Western",7.6,34075,NaN
997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,30500000
998,Lifeboat,1944,"Drama, War",7.6,26471,NaN
999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,NaN

In [300]:
#convert data into an integer so we can use it as numeric data 
# and all null values replaced by 0 . 
movies['Gross'].fillna(0, inplace=True)
movies['Gross']  = movies['Gross'] .astype ('int64')
movies

C:\Users\IDEAL INFO\AppData\Local\Temp\ipykernel_22260\3870910997.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  movies['Gross'].fillna(0, inplace=True)

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,28341469
1,The Godfather,1972,"Crime, Drama",9.2,1620367,134966411
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,534858444
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,57300000
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,4360000
...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,0
996,Giant,1956,"Drama, Western",7.6,34075,0
997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,30500000
998,Lifeboat,1944,"Drama, War",7.6,26471,0
999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,0

In [303]:
# now gross is available because we changed his type as a numeric one  
movies.describe().round()

       IMDB_Rating  No_of_Votes        Gross
count       1000.0       1000.0       1000.0
mean           8.0     273693.0   56536878.0
std            0.0     327373.0  103238179.0
min            8.0      25088.0          0.0
25%            8.0      55526.0     445710.0
50%            8.0     138548.0   10702752.0
75%            8.0     374161.0   61539891.0
max            9.0    2343110.0  936662225.0

In [306]:
#we can use movies.count to get the total of all the elments 
movies.count()

Series_Title     1000
Released_Year    1000
Genre            1000
IMDB_Rating      1000
No_of_Votes      1000
Gross            1000
dtype: int64

In [317]:
#calculate the avg for numerical types only 
movies.mean(numeric_only=True).round()

IMDB_Rating           8.0
No_of_Votes      273693.0
Gross          56536878.0
dtype: float64

In [318]:
#calculate the max for numerical types only 

movies.max(numeric_only=True).round()

IMDB_Rating            9.0
No_of_Votes      2343110.0
Gross          936662225.0
dtype: float64

In [321]:
#calculate the min for numerical types only 
movies.min(numeric_only=True).round()

IMDB_Rating        8.0
No_of_Votes    25088.0
Gross              0.0
dtype: float64

In [323]:
#we defined the quantile to be 50% 
movies.quantile(q=.5,numeric_only=True).round(2)

IMDB_Rating           7.9
No_of_Votes      138548.5
Gross          10702751.5
Name: 0.5, dtype: float64

In [329]:
#we include the string type in our rslt 
#except this time it's going to be recording the  strings .
movies.describe(include=['O'])

       Series_Title Released_Year  Genre
count          1000          1000   1000
unique          999           100    202
top        Drishyam          2014  Drama
freq              2            32     85

In [352]:
#we define the cols we need
clos=['Series_Title','IMDB_Rating','No_of_Votes']

In [353]:
#Reading the csv file(database) , and using the columns 
movies =pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\imdb_top_1000.csv', usecols=cols)
movies

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,"28,341,469"
1,The Godfather,1972,"Crime, Drama",9.2,1620367,"134,966,411"
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,"534,858,444"
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,"57,300,000"
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,"4,360,000"
...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,NaN
996,Giant,1956,"Drama, Western",7.6,34075,NaN
997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,"30,500,000"
998,Lifeboat,1944,"Drama, War",7.6,26471,NaN
999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,NaN

In [ ]:
#we will have our dataframe sorted with the 10 largest values for the number of votes 
movies.nlargest(n=10, columns=['No_of_Votes'])

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,"28,341,469"
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,"534,858,444"
8,Inception,2010,"Action, Adventure, Sci-Fi",8.8,2067042,"292,576,195"
9,Fight Club,1999,Drama,8.8,1854740,"37,030,102"
6,Pulp Fiction,1994,"Crime, Drama",8.9,1826188,"107,928,762"
11,Forrest Gump,1994,"Drama, Romance",8.8,1809221,"330,252,182"
14,The Matrix,1999,"Action, Sci-Fi",8.7,1676426,"171,479,930"
10,The Lord of the Rings: The Fellowship of the Ring,2001,"Action, Adventure, Drama",8.8,1661481,"315,544,750"
5,The Lord of the Rings: The Return of the King,2003,"Action, Adventure, Drama",8.9,1642758,"377,845,905"
1,The Godfather,1972,"Crime, Drama",9.2,1620367,"134,966,411"

In [ ]:
#we will have our dataframe sorted with the 10 largest values for the IMDB_Rating and the number of votes 
#gives priority first to IMDB_Rating and then to No_of_Votes
movies.nlargest(n=10, columns=['IMDB_Rating','No_of_Votes'])

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,"28,341,469"
1,The Godfather,1972,"Crime, Drama",9.2,1620367,"134,966,411"
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,"534,858,444"
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,"57,300,000"
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,"4,360,000"
6,Pulp Fiction,1994,"Crime, Drama",8.9,1826188,"107,928,762"
5,The Lord of the Rings: The Return of the King,2003,"Action, Adventure, Drama",8.9,1642758,"377,845,905"
7,Schindler's List,1993,"Biography, Drama, History",8.9,1213505,"96,898,818"
8,Inception,2010,"Action, Adventure, Sci-Fi",8.8,2067042,"292,576,195"
9,Fight Club,1999,Drama,8.8,1854740,"37,030,102"

In [349]:
#we will have our dataframe sorted with the 10 smallest values for  the number of votes 

movies.nsmallest(n=10, columns=['No_of_Votes'])

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
264,Ba wang bie ji,1993,"Drama, Music, Romance",8.1,25088,"5,216,888"
721,God's Own Country,2017,"Drama, Romance",7.7,25198,"335,609"
694,La planète sauvage,1973,"Animation, Sci-Fi",7.8,25229,"193,817"
718,Scarface: The Shame of the Nation,1932,"Action, Crime, Drama",7.8,25312,NaN
570,Raazi,2018,"Action, Drama, Thriller",7.8,25344,NaN
785,The Magdalene Sisters,2002,Drama,7.7,25938,"4,890,878"
989,The Long Goodbye,1973,"Comedy, Crime, Drama",7.6,26337,"959,000"
169,Dom za vesanje,1988,"Comedy, Crime, Drama",8.2,26402,"280,015"
814,Do lok tin si,1995,"Comedy, Crime, Drama",7.7,26429,NaN
863,Cape Fear,1962,"Drama, Thriller",7.7,26457,NaN

In [ ]:
#we will have our dataframe sorted with the 10 smallest values for the IMDB_Rating and the number of votes 

movies.nsmallest(n=10, columns=['IMDB_Rating','No_of_Votes'])

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
989,The Long Goodbye,1973,"Comedy, Crime, Drama",7.6,26337,"959,000"
998,Lifeboat,1944,"Drama, War",7.6,26471,NaN
971,Omohide poro poro,1991,"Animation, Drama, Romance",7.6,27071,"453,243"
981,On Golden Pond,1981,Drama,7.6,27650,"119,285,432"
880,Nelyubov,2017,Drama,7.6,29765,"566,356"
990,Giù la testa,1971,"Drama, War, Western",7.6,30144,"696,690"
920,The Secret of Kells,2009,"Animation, Adventure, Family",7.6,31779,"686,383"
984,The Muppet Movie,1979,"Adventure, Comedy, Family",7.6,32802,"76,657,000"
986,Watership Down,1978,"Animation, Adventure, Drama",7.6,33656,NaN
996,Giant,1956,"Drama, Western",7.6,34075,NaN

In [347]:
#keep='first' it means it will keep the first duplicate 
# keep='last , it will keep the lasts duplicate
# #keep='all' , it will keep all duplicates 
movies.nsmallest(n=10, columns=['IMDB_Rating'],keep='first')

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
877,Dark Waters,2019,"Biography, Drama, History",7.6,60408,NaN
878,Searching,2018,"Drama, Mystery, Thriller",7.6,140840,"26,020,957"
879,Once Upon a Time... in Hollywood,2019,"Comedy, Drama",7.6,551309,"142,502,728"
880,Nelyubov,2017,Drama,7.6,29765,"566,356"
881,The Florida Project,2017,Drama,7.6,95181,"5,904,366"
882,Just Mercy,2019,"Biography, Crime, Drama",7.6,46739,NaN
883,Gifted,2017,Drama,7.6,99643,"24,801,212"
884,The Peanut Butter Falcon,2019,"Adventure, Comedy, Drama",7.6,66346,"13,122,642"
885,Victoria,2015,"Crime, Drama, Romance",7.6,52903,NaN
886,Mustang,2015,Drama,7.6,35785,"845,464"

In [ ]:
#you can still use sort_values(), it's less efficient and less optimized than using nlargest or nsmallest, which means it can take longer.
movies.sort_values(by=['IMDB_Rating','No_of_Votes'],ascending=False).head(10)

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,"28,341,469"
1,The Godfather,1972,"Crime, Drama",9.2,1620367,"134,966,411"
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,"534,858,444"
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,"57,300,000"
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,"4,360,000"
6,Pulp Fiction,1994,"Crime, Drama",8.9,1826188,"107,928,762"
5,The Lord of the Rings: The Return of the King,2003,"Action, Adventure, Drama",8.9,1642758,"377,845,905"
7,Schindler's List,1993,"Biography, Drama, History",8.9,1213505,"96,898,818"
8,Inception,2010,"Action, Adventure, Sci-Fi",8.8,2067042,"292,576,195"
9,Fight Club,1999,Drama,8.8,1854740,"37,030,102"

In [ ]:
#in these steps, we tray how can modify the index in our dataframes using some of built metods provided.

In [351]:
#Reading the csv file(database) , and using the columns 
movies =pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\imdb_top_1000.csv', usecols=cols)
movies

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,"28,341,469"
1,The Godfather,1972,"Crime, Drama",9.2,1620367,"134,966,411"
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,"534,858,444"
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,"57,300,000"
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,"4,360,000"
...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,NaN
996,Giant,1956,"Drama, Western",7.6,34075,NaN
997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,"30,500,000"
998,Lifeboat,1944,"Drama, War",7.6,26471,NaN
999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,NaN

In [356]:
#we have a new index that's not numerical  , it's called series title , and it's using title as the index. 
#if drop=True , you drop the column serirs_title from the rslt of dataframe. 
movies.set_index('Series_Title', drop=False, inplace=False )

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
Series_Title,,,,,,
The Shawshank Redemption,The Shawshank Redemption,1994,Drama,9.3,2343110,"28,341,469"
The Godfather,The Godfather,1972,"Crime, Drama",9.2,1620367,"134,966,411"
The Dark Knight,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,"534,858,444"
The Godfather: Part II,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,"57,300,000"
12 Angry Men,12 Angry Men,1957,"Crime, Drama",9.0,689845,"4,360,000"
...,...,...,...,...,...,...
Breakfast at Tiffany's,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,NaN
Giant,Giant,1956,"Drama, Western",7.6,34075,NaN
From Here to Eternity,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,"30,500,000"
Lifeboat,Lifeboat,1944,"Drama, War",7.6,26471,NaN
The 39 Steps,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,NaN

In [362]:
# .index.name = we named the column of index by INDEXX
# the column INDEXX represent the indexes 

movies.index.name='INDEXX '
movies

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
INDEXX,,,,,,
0,The Shawshank Redemption,1994,Drama,9.3,2343110,"28,341,469"
1,The Godfather,1972,"Crime, Drama",9.2,1620367,"134,966,411"
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,"534,858,444"
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,"57,300,000"
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,"4,360,000"
...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,NaN
996,Giant,1956,"Drama, Western",7.6,34075,NaN
997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,"30,500,000"
998,Lifeboat,1944,"Drama, War",7.6,26471,NaN
999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,NaN

In [364]:
#we're going to get what we originally had .
movies.reset_index(drop=False , inplace=False )

,INDEXX,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,0,The Shawshank Redemption,1994,Drama,9.3,2343110,"28,341,469"
1,1,The Godfather,1972,"Crime, Drama",9.2,1620367,"134,966,411"
2,2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,"534,858,444"
3,3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,"57,300,000"
4,4,12 Angry Men,1957,"Crime, Drama",9.0,689845,"4,360,000"
...,...,...,...,...,...,...,...
995,995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,NaN
996,996,Giant,1956,"Drama, Western",7.6,34075,NaN
997,997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,"30,500,000"
998,998,Lifeboat,1944,"Drama, War",7.6,26471,NaN
999,999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,NaN

In [367]:
#if we put drop=true , we lose our title for index columns 
movies.reset_index(drop=True , inplace=True)
movies

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,"28,341,469"
1,The Godfather,1972,"Crime, Drama",9.2,1620367,"134,966,411"
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,"534,858,444"
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,"57,300,000"
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,"4,360,000"
...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,NaN
996,Giant,1956,"Drama, Western",7.6,34075,NaN
997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,"30,500,000"
998,Lifeboat,1944,"Drama, War",7.6,26471,NaN
999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,NaN

In [370]:
# in this steps we removing columns/rows in a dataframe 
#in this code we just read the dataset , and we select the 3 first elements
movies= pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\imdb_top_1000.csv')
movies.head(3)

,Poster_Link,Series_Title,Released_Year,Certificate,Runtime,Genre,IMDB_Rating,Overview,Meta_score,Director,Star1,Star2,Star3,Star4,No_of_Votes,Gross
0,https://m.media-amazon.com/images/M/MV5BMDFkYT...,The Shawshank Redemption,1994,A,142 min,Drama,9.3,Two imprisoned men bond over a number of years...,80.0,Frank Darabont,Tim Robbins,Morgan Freeman,Bob Gunton,William Sadler,2343110,"28,341,469"
1,https://m.media-amazon.com/images/M/MV5BM2MyNj...,The Godfather,1972,A,175 min,"Crime, Drama",9.2,An organized crime dynasty's aging patriarch t...,100.0,Francis Ford Coppola,Marlon Brando,Al Pacino,James Caan,Diane Keaton,1620367,"134,966,411"
2,https://m.media-amazon.com/images/M/MV5BMTMxNT...,The Dark Knight,2008,UA,152 min,"Action, Crime, Drama",9.0,When the menace known as the Joker wreaks havo...,84.0,Christopher Nolan,Christian Bale,Heath Ledger,Aaron Eckhart,Michael Caine,2303232,"534,858,444"

In [373]:
#we specify which colmuns we need exactly. 
#a way to select columns .
movies[['Series_Title','Genre']]

                 Series_Title                     Genre
0    The Shawshank Redemption                     Drama
1               The Godfather              Crime, Drama
2             The Dark Knight      Action, Crime, Drama
3      The Godfather: Part II              Crime, Drama
4                12 Angry Men              Crime, Drama
..                        ...                       ...
995    Breakfast at Tiffany's    Comedy, Drama, Romance
996                     Giant            Drama, Western
997     From Here to Eternity       Drama, Romance, War
998                  Lifeboat                Drama, War
999              The 39 Steps  Crime, Mystery, Thriller

[1000 rows x 2 columns]

In [384]:
#with .drop , we can specify the columns that we want to remove 
movies.drop(columns=['Overview'], inplace=True)
movies

,Series_Title,Released_Year,Certificate,Runtime,Genre,IMDB_Rating,Meta_score,Director,Star1,Star2,Star3,Star4,No_of_Votes,Gross
0,The Shawshank Redemption,1994,A,142 min,Drama,9.3,80.0,Frank Darabont,Tim Robbins,Morgan Freeman,Bob Gunton,William Sadler,2343110,"28,341,469"
1,The Godfather,1972,A,175 min,"Crime, Drama",9.2,100.0,Francis Ford Coppola,Marlon Brando,Al Pacino,James Caan,Diane Keaton,1620367,"134,966,411"
2,The Dark Knight,2008,UA,152 min,"Action, Crime, Drama",9.0,84.0,Christopher Nolan,Christian Bale,Heath Ledger,Aaron Eckhart,Michael Caine,2303232,"534,858,444"
3,The Godfather: Part II,1974,A,202 min,"Crime, Drama",9.0,90.0,Francis Ford Coppola,Al Pacino,Robert De Niro,Robert Duvall,Diane Keaton,1129952,"57,300,000"
4,12 Angry Men,1957,U,96 min,"Crime, Drama",9.0,96.0,Sidney Lumet,Henry Fonda,Lee J. Cobb,Martin Balsam,John Fiedler,689845,"4,360,000"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,A,115 min,"Comedy, Drama, Romance",7.6,76.0,Blake Edwards,Audrey Hepburn,George Peppard,Patricia Neal,Buddy Ebsen,166544,NaN
996,Giant,1956,G,201 min,"Drama, Western",7.6,84.0,George Stevens,Elizabeth Taylor,Rock Hudson,James Dean,Carroll Baker,34075,NaN
997,From Here to Eternity,1953,Passed,118 min,"Drama, Romance, War",7.6,85.0,Fred Zinnemann,Burt Lancaster,Montgomery Clift,Deborah Kerr,Donna Reed,43374,"30,500,000"
998,Lifeboat,1944,NaN,97 min,"Drama, War",7.6,78.0,Alfred Hitchcock,Tallulah Bankhead,John Hodiak,Walter Slezak,William Bendix,26471,NaN
999,The 39 Steps,1935,NaN,86 min,"Crime, Mystery, Thriller",7.6,93.0,Alfred Hitchcock,Robert Donat,Madeleine Carroll,Lucie Mannheim,Godfrey Tearle,51853,NaN

In [385]:
#removes all the index labels that we specify from the dataframe 
#it's going to remove the first 3 labels 
movies.drop(labels=[0,1,2])

,Series_Title,Released_Year,Certificate,Runtime,Genre,IMDB_Rating,Meta_score,Director,Star1,Star2,Star3,Star4,No_of_Votes,Gross
3,The Godfather: Part II,1974,A,202 min,"Crime, Drama",9.0,90.0,Francis Ford Coppola,Al Pacino,Robert De Niro,Robert Duvall,Diane Keaton,1129952,"57,300,000"
4,12 Angry Men,1957,U,96 min,"Crime, Drama",9.0,96.0,Sidney Lumet,Henry Fonda,Lee J. Cobb,Martin Balsam,John Fiedler,689845,"4,360,000"
5,The Lord of the Rings: The Return of the King,2003,U,201 min,"Action, Adventure, Drama",8.9,94.0,Peter Jackson,Elijah Wood,Viggo Mortensen,Ian McKellen,Orlando Bloom,1642758,"377,845,905"
6,Pulp Fiction,1994,A,154 min,"Crime, Drama",8.9,94.0,Quentin Tarantino,John Travolta,Uma Thurman,Samuel L. Jackson,Bruce Willis,1826188,"107,928,762"
7,Schindler's List,1993,A,195 min,"Biography, Drama, History",8.9,94.0,Steven Spielberg,Liam Neeson,Ralph Fiennes,Ben Kingsley,Caroline Goodall,1213505,"96,898,818"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,A,115 min,"Comedy, Drama, Romance",7.6,76.0,Blake Edwards,Audrey Hepburn,George Peppard,Patricia Neal,Buddy Ebsen,166544,NaN
996,Giant,1956,G,201 min,"Drama, Western",7.6,84.0,George Stevens,Elizabeth Taylor,Rock Hudson,James Dean,Carroll Baker,34075,NaN
997,From Here to Eternity,1953,Passed,118 min,"Drama, Romance, War",7.6,85.0,Fred Zinnemann,Burt Lancaster,Montgomery Clift,Deborah Kerr,Donna Reed,43374,"30,500,000"
998,Lifeboat,1944,NaN,97 min,"Drama, War",7.6,78.0,Alfred Hitchcock,Tallulah Bankhead,John Hodiak,Walter Slezak,William Bendix,26471,NaN
999,The 39 Steps,1935,NaN,86 min,"Crime, Mystery, Thriller",7.6,93.0,Alfred Hitchcock,Robert Donat,Madeleine Carroll,Lucie Mannheim,Godfrey Tearle,51853,NaN

In [387]:
#drop the 2 and 3 sets from the dataframe 
movies.drop([2,3])

,Series_Title,Released_Year,Certificate,Runtime,Genre,IMDB_Rating,Meta_score,Director,Star1,Star2,Star3,Star4,No_of_Votes,Gross
0,The Shawshank Redemption,1994,A,142 min,Drama,9.3,80.0,Frank Darabont,Tim Robbins,Morgan Freeman,Bob Gunton,William Sadler,2343110,"28,341,469"
1,The Godfather,1972,A,175 min,"Crime, Drama",9.2,100.0,Francis Ford Coppola,Marlon Brando,Al Pacino,James Caan,Diane Keaton,1620367,"134,966,411"
4,12 Angry Men,1957,U,96 min,"Crime, Drama",9.0,96.0,Sidney Lumet,Henry Fonda,Lee J. Cobb,Martin Balsam,John Fiedler,689845,"4,360,000"
5,The Lord of the Rings: The Return of the King,2003,U,201 min,"Action, Adventure, Drama",8.9,94.0,Peter Jackson,Elijah Wood,Viggo Mortensen,Ian McKellen,Orlando Bloom,1642758,"377,845,905"
6,Pulp Fiction,1994,A,154 min,"Crime, Drama",8.9,94.0,Quentin Tarantino,John Travolta,Uma Thurman,Samuel L. Jackson,Bruce Willis,1826188,"107,928,762"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,A,115 min,"Comedy, Drama, Romance",7.6,76.0,Blake Edwards,Audrey Hepburn,George Peppard,Patricia Neal,Buddy Ebsen,166544,NaN
996,Giant,1956,G,201 min,"Drama, Western",7.6,84.0,George Stevens,Elizabeth Taylor,Rock Hudson,James Dean,Carroll Baker,34075,NaN
997,From Here to Eternity,1953,Passed,118 min,"Drama, Romance, War",7.6,85.0,Fred Zinnemann,Burt Lancaster,Montgomery Clift,Deborah Kerr,Donna Reed,43374,"30,500,000"
998,Lifeboat,1944,NaN,97 min,"Drama, War",7.6,78.0,Alfred Hitchcock,Tallulah Bankhead,John Hodiak,Walter Slezak,William Bendix,26471,NaN
999,The 39 Steps,1935,NaN,86 min,"Crime, Mystery, Thriller",7.6,93.0,Alfred Hitchcock,Robert Donat,Madeleine Carroll,Lucie Mannheim,Godfrey Tearle,51853,NaN

In [390]:
# in this steps we Adding columns  in a dataframe 
movies= pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\imdb_top_1000.csv', usecols=['Series_Title','IMDB_Rating','No_of_Votes'])
movies

                 Series_Title  IMDB_Rating  No_of_Votes
0    The Shawshank Redemption          9.3      2343110
1               The Godfather          9.2      1620367
2             The Dark Knight          9.0      2303232
3      The Godfather: Part II          9.0      1129952
4                12 Angry Men          9.0       689845
..                        ...          ...          ...
995    Breakfast at Tiffany's          7.6       166544
996                     Giant          7.6        34075
997     From Here to Eternity          7.6        43374
998                  Lifeboat          7.6        26471
999              The 39 Steps          7.6        51853

[1000 rows x 3 columns]

In [ ]:
#return a series 
movies['IMDB_Rating']

0      9.3
1      9.2
2      9.0
3      9.0
4      9.0
      ...
995    7.6
996    7.6
997    7.6
998    7.6
999    7.6
Name: IMDB_Rating, Length: 1000, dtype: float64

In [392]:
#returns a dataframe 
movies[['IMDB_Rating','No_of_Votes']]

     IMDB_Rating  No_of_Votes
0            9.3      2343110
1            9.2      1620367
2            9.0      2303232
3            9.0      1129952
4            9.0       689845
..           ...          ...
995          7.6       166544
996          7.6        34075
997          7.6        43374
998          7.6        26471
999          7.6        51853

[1000 rows x 2 columns]

In [ ]:
#we dont have a columns named watched , so we put it with value=False 
#and that's the rslt 
movies['Watched']=False 
movies

                 Series_Title  IMDB_Rating  No_of_Votes  Watched
0    The Shawshank Redemption          9.3      2343110    False
1               The Godfather          9.2      1620367    False
2             The Dark Knight          9.0      2303232    False
3      The Godfather: Part II          9.0      1129952    False
4                12 Angry Men          9.0       689845    False
..                        ...          ...          ...      ...
995    Breakfast at Tiffany's          7.6       166544    False
996                     Giant          7.6        34075    False
997     From Here to Eternity          7.6        43374    False
998                  Lifeboat          7.6        26471    False
999              The 39 Steps          7.6        51853    False

[1000 rows x 4 columns]

In [396]:
#we insert a new column named  My_rating with none as a value 
movies.insert(loc=2, column='My_Rating', value = None )
movies

ValueError: cannot insert My_Rating, already exists

In [397]:
movies

                 Series_Title  IMDB_Rating My_Rating  No_of_Votes  Watched
0    The Shawshank Redemption          9.3      None      2343110    False
1               The Godfather          9.2      None      1620367    False
2             The Dark Knight          9.0      None      2303232    False
3      The Godfather: Part II          9.0      None      1129952    False
4                12 Angry Men          9.0      None       689845    False
..                        ...          ...       ...          ...      ...
995    Breakfast at Tiffany's          7.6      None       166544    False
996                     Giant          7.6      None        34075    False
997     From Here to Eternity          7.6      None        43374    False
998                  Lifeboat          7.6      None        26471    False
999              The 39 Steps          7.6      None        51853    False

[1000 rows x 5 columns]

In [400]:
#just we read a file  of our dataset 
df= pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\learning_path\data_manipulation_with_pandas\sample.csv')
df

                     Name  Age
0          Zhong Shanshan   67
1            Zhang Yiming   38
2    Yang Huiyan & family   40
3        William Lei Ding   50
4          Warren Buffett   91
..                    ...  ...
96         Andrew Forrest   60
97         Amancio Ortega   86
98           Alice Walton   72
99       Alain Wertheimer   73
100       Abigail Johnson   60

[101 rows x 2 columns]

In [ ]:

# with .dropn() we remove all none all null values 

#remove the rows that had those missing values .
df.dropna()

                     Name  Age
0          Zhong Shanshan   67
1            Zhang Yiming   38
2    Yang Huiyan & family   40
3        William Lei Ding   50
4          Warren Buffett   91
..                    ...  ...
96         Andrew Forrest   60
97         Amancio Ortega   86
98           Alice Walton   72
99       Alain Wertheimer   73
100       Abigail Johnson   60

[101 rows x 2 columns]

In [402]:
data= {'a' :[1,2,3,None], 
       'b' : [5,None, 7,8],
       'c': [9,None, 11, None ],
       'd' :[13,14, None, 16] }
df= pd.DataFrame(data)
df

     a    b     c     d
0  1.0  5.0   9.0  13.0
1  2.0  NaN   NaN  14.0
2  3.0  7.0  11.0   NaN
3  NaN  8.0   NaN  16.0

In [ ]:
#.fillna , used the previous valid value to fill the next valid value 
#replace the nan value with the nearly one 
df.fillna(method='ffill')

C:\Users\IDEAL INFO\AppData\Local\Temp\ipykernel_22260\253117906.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

     a    b     c     d
0  1.0  5.0   9.0  13.0
1  2.0  5.0   9.0  14.0
2  3.0  7.0  11.0  14.0
3  3.0  8.0  11.0  16.0

In [ ]:
#.bfill  , used the previous valid value to fill the next valid value , if there is not a correct value , he cant change the null one . 
#we have some null value 

df.fillna(method='bfill')

C:\Users\IDEAL INFO\AppData\Local\Temp\ipykernel_22260\4194935721.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

     a    b     c     d
0  1.0  5.0   9.0  13.0
1  2.0  7.0  11.0  14.0
2  3.0  7.0  11.0  16.0
3  NaN  8.0   NaN  16.0

In [405]:
#you can also define an axis 

df.fillna(method='ffill', axis=1 )

C:\Users\IDEAL INFO\AppData\Local\Temp\ipykernel_22260\2001392281.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=1 )

     a    b     c     d
0  1.0  5.0   9.0  13.0
1  2.0  2.0   2.0  14.0
2  3.0  7.0  11.0  11.0
3  NaN  8.0   8.0  16.0

In [ ]:
#will only replace 1 value per row or column
df.fillna(value='????', limit=1 , axis=1  )

      a     b     c     d
0   1.0   5.0   9.0  13.0
1   2.0  ????   NaN  14.0
2   3.0   7.0  11.0  ????
3  ????   8.0   NaN  16.0

In [407]:
df.fillna('????')

      a     b     c     d
0   1.0   5.0   9.0  13.0
1   2.0  ????  ????  14.0
2   3.0   7.0  11.0  ????
3  ????   8.0  ????  16.0

In [ ]:
#just we read a file  of our dataset and we choice the columns 
coles=['Series_Title','IMDB_Rating','No_of_Votes','Gross','Released_Year','Genre']
movies= pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\imdb_top_1000.csv' ,usecols=cols)
movies

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,"28,341,469"
1,The Godfather,1972,"Crime, Drama",9.2,1620367,"134,966,411"
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,"534,858,444"
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,"57,300,000"
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,"4,360,000"
...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,NaN
996,Giant,1956,"Drama, Western",7.6,34075,NaN
997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,"30,500,000"
998,Lifeboat,1944,"Drama, War",7.6,26471,NaN
999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,NaN

In [416]:
#find the lowest scored movie with the lowest amout of votes 
movies.nsmallest(n=1, columns=['IMDB_Rating','No_of_Votes'])

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
989,The Long Goodbye,1973,"Comedy, Crime, Drama",7.6,26337,"959,000"

In [417]:
#find the highest scored movie with the highest amout of votes 
movies.nlargest(n=1, columns=['IMDB_Rating','No_of_Votes'])

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,"28,341,469"

In [ ]:
#find the top 5 genres
movies.value_counts('Genre').head(5)

Genre
Drama                     85
Drama, Romance            37
Comedy, Drama             35
Comedy, Drama, Romance    31
Action, Crime, Drama      30
Name: count, dtype: int64

In [ ]:
#we replace thee comma with space in the column Gross , to be able to read it correctly 
#we've got a Nan value because its a string not int 

movies['Gross'] = movies['Gross'].str.replace(',','')
movies

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,28341469
1,The Godfather,1972,"Crime, Drama",9.2,1620367,134966411
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,534858444
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,57300000
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,4360000
...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,NaN
996,Giant,1956,"Drama, Western",7.6,34075,NaN
997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,30500000
998,Lifeboat,1944,"Drama, War",7.6,26471,NaN
999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,NaN

In [422]:
#we need to remove all the Nan value 
#we replace the Nan value with 0 
#and we change the type .astype integer 

movies.fillna(0, inplace=True )
movies['Gross']=movies['Gross'].astype('int64')
movies

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
0,The Shawshank Redemption,1994,Drama,9.3,2343110,28341469
1,The Godfather,1972,"Crime, Drama",9.2,1620367,134966411
2,The Dark Knight,2008,"Action, Crime, Drama",9.0,2303232,534858444
3,The Godfather: Part II,1974,"Crime, Drama",9.0,1129952,57300000
4,12 Angry Men,1957,"Crime, Drama",9.0,689845,4360000
...,...,...,...,...,...,...
995,Breakfast at Tiffany's,1961,"Comedy, Drama, Romance",7.6,166544,0
996,Giant,1956,"Drama, Western",7.6,34075,0
997,From Here to Eternity,1953,"Drama, Romance, War",7.6,43374,30500000
998,Lifeboat,1944,"Drama, War",7.6,26471,0
999,The 39 Steps,1935,"Crime, Mystery, Thriller",7.6,51853,0

In [424]:
#we show the top 3 of columns gross 
movies.nlargest(n=3, columns='Gross')

,Series_Title,Released_Year,Genre,IMDB_Rating,No_of_Votes,Gross
477,Star Wars: Episode VII - The Force Awakens,2015,"Action, Adventure, Sci-Fi",7.9,860823,936662225
59,Avengers: Endgame,2019,"Action, Adventure, Drama",8.4,809955,858373000
623,Avatar,2009,"Action, Adventure, Fantasy",7.8,1118998,760507625

In [ ]:

import pandas as pd

In [436]:
#to read a excel file 
titanic= pd.read_excel(r'C:\Users\IDEAL INFO\Documents\data_pipelines\titanic3.xls', index_col='name')
titanic

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allison, Master. Hudson Trevor",1,1,male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
"Zabour, Miss. Thamine",3,0,female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
"Zakarian, Mr. Mapriededer",3,0,male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
"Zakarian, Mr. Ortin",3,0,male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
"Zimmerman, Mr. Leo",3,0,male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [ ]:
#wwe need to know some info for our data
#so we have many types like integer , float , object(string..)
#we have 1309 entries , 14 columns ..

titanic.info(

)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [438]:
#sort the index 
titanic.sort_index(inplace=True)
titanic

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Abbing, Mr. Anthony",3,0,male,42.0,0,0,C.A. 5547,7.5500,NaN,S,NaN,NaN,NaN
"Abbott, Master. Eugene Joseph",3,0,male,13.0,0,2,C.A. 2673,20.2500,NaN,S,NaN,NaN,"East Providence, RI"
"Abbott, Mr. Rossmore Edward",3,0,male,16.0,1,1,C.A. 2673,20.2500,NaN,S,NaN,190.0,"East Providence, RI"
"Abbott, Mrs. Stanton (Rosa Hunt)",3,1,female,35.0,1,1,C.A. 2673,20.2500,NaN,S,A,NaN,"East Providence, RI"
"Abelseth, Miss. Karen Marie",3,1,female,16.0,0,0,348125,7.6500,NaN,S,16,NaN,"Norway Los Angeles, CA"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
"del Carlo, Mrs. Sebastiano (Argenia Genovesi)",2,1,female,24.0,1,0,SC/PARIS 2167,27.7208,NaN,C,12,NaN,"Lucca, Italy / California"
"van Billiard, Master. James William",3,0,male,NaN,1,1,A/5. 851,14.5000,NaN,S,NaN,NaN,NaN
"van Billiard, Master. Walter John",3,0,male,11.5,1,1,A/5. 851,14.5000,NaN,S,NaN,1.0,NaN
"van Billiard, Mr. Austin Blyler",3,0,male,40.5,0,2,A/5. 851,14.5000,NaN,S,NaN,255.0,NaN
"van Melkebeke, Mr. Philemon",3,0,male,NaN,0,0,345777,9.5000,NaN,S,NaN,NaN,NaN

In [ ]:
#we select a row from dataframe 
#you want to get a row back from your dataframe 
#---> selection w row via index (for 1 passenger )
titanic.loc['Abbott, Mr. Rossmore Edward']

pclass                         3
survived                       0
sex                         male
age                         16.0
sibsp                          1
parch                          1
ticket                 C.A. 2673
fare                       20.25
cabin                        NaN
embarked                       S
boat                         NaN
body                       190.0
home.dest    East Providence, RI
Name: Abbott, Mr. Rossmore Edward, dtype: object

In [ ]:

#to select a rows information for more than 1 passenger , as a list 
#.loc() : allows us to use labels to select rows 
titanic.loc [['Abbott, Mr. Rossmore Edward' , 'Abbott, Mrs. Stanton (Rosa Hunt)']]

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Abbott, Mr. Rossmore Edward",3,0,male,16.0,1,1,C.A. 2673,20.25,NaN,S,NaN,190.0,"East Providence, RI"
"Abbott, Mrs. Stanton (Rosa Hunt)",3,1,female,35.0,1,1,C.A. 2673,20.25,NaN,S,A,NaN,"East Providence, RI"

In [ ]:
#if there are duplicate , it will return them all 
titanic.loc['Kelly, Mr. James']

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Kelly, Mr. James",3,0,male,34.5,0,0,330911,7.8292,NaN,Q,NaN,70.0,NaN
"Kelly, Mr. James",3,0,male,44.0,0,0,363592,8.0500,NaN,S,NaN,NaN,NaN

In [452]:
#select a row from allen miss elisabeth to/under allison miss helen .. 
titanic.loc['Allen, Miss. Elisabeth Walton': 'Allison, Miss. Helene Loraine']

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allen, Mr. William Henry",3,0,male,35.0000,0,0,373450,8.0500,NaN,S,NaN,NaN,"Lower Clapton, Middlesex or Erdington, Birmingham"
"Allison, Master. Hudson Trevor",1,1,male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [454]:
#just load 3 element from dataset 
titanic= pd.read_excel(r'C:\Users\IDEAL INFO\Documents\data_pipelines\titanic3.xls', index_col='name')
titanic.head(3)

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allison, Master. Hudson Trevor",1,1,male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [456]:
#returns a value for the passenger , and the value of  a specified column
titanic.loc['Allison, Miss. Helen Loraine', 'fare']

np.float64(151.55)

In [ ]:
#returns a value for the passenger , and the value of  a specified 3 column as a list  

titanic.loc['Allison, Miss. Helen Loraine', ['fare','sex','cabin']]

fare      151.55
sex       female
cabin    C22 C26
Name: Allison, Miss. Helen Loraine, dtype: object

In [ ]:
#we're going to get another series back with both of the passengers we selected , and both of their fares 
#returns the fare for all the passengers as a series
passengers=['Allen, Miss. Elisabeth Walton', 'Allison, Miss. Helen Loraine']
titanic.loc[passengers, 'fare']

name
Allen, Miss. Elisabeth Walton    211.3375
Allison, Miss. Helen Loraine     151.5500
Name: fare, dtype: float64

In [ ]:
#we're going to get another series back with both of the passengers we selected , their fares , pclass and survived columns 
#returns a dataframe of the passengers we select with the specified columns 
passengers=['Allen, Miss. Elisabeth Walton', 'Allison, Miss. Helen Loraine']
titanic.loc[passengers, ['fare', 'pclass','survived']]

                                   fare  pclass  survived
name
Allen, Miss. Elisabeth Walton  211.3375       1         1
Allison, Miss. Helen Loraine   151.5500       1         0

In [475]:

titanic= pd.read_excel(r'C:\Users\IDEAL INFO\Documents\data_pipelines\titanic3.xls', usecols=['name', 'sex', 'age', 'pclass', 'fare']  )
titanic

,pclass,name,sex,age,fare
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,211.3375
1,1,"Allison, Master. Hudson Trevor",male,0.9167,151.5500
2,1,"Allison, Miss. Helen Loraine",female,2.0000,151.5500
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,151.5500
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,151.5500
...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,14.4542
1305,3,"Zabour, Miss. Thamine",female,NaN,14.4542
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,7.2250
1307,3,"Zakarian, Mr. Ortin",male,27.0000,7.2250
1308,3,"Zimmerman, Mr. Leo",male,29.0000,7.8750

In [476]:
#select the row at the index of 0 
#w've got name: allen because she have a index 0 
titanic.iloc[0]

pclass                                1
name      Allen, Miss. Elisabeth Walton
sex                              female
age                                29.0
fare                           211.3375
Name: 0, dtype: object

In [477]:
#from 0 to 6 index 
titanic.iloc[0:6]

,pclass,name,sex,age,fare
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,211.3375
1,1,"Allison, Master. Hudson Trevor",male,0.9167,151.5500
2,1,"Allison, Miss. Helen Loraine",female,2.0000,151.5500
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,151.5500
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,151.5500
5,1,"Anderson, Mr. Harry",male,48.0000,26.5500

In [478]:
# 0 to 6(excluded ) with a step of 2 
titanic.iloc[0:6:2]

,pclass,name,sex,age,fare
0,1,"Allen, Miss. Elisabeth Walton",female,29.0,211.3375
2,1,"Allison, Miss. Helen Loraine",female,2.0,151.5500
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,151.5500

In [ ]:
#selecting specific indices 
titanic.iloc[[100,200,300]]

     pclass                                          name   sex   age     fare
100       1  Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")  male  49.0  56.9292
200       1                  McCaffry, Mr. Thomas Francis  male  46.0  75.2417
300       1                     Van der hoef, Mr. Wyckoff  male  61.0  33.5000

In [481]:
#get the last 3 rows 
titanic.iloc[-3:]

      pclass                       name   sex   age   fare
1306       3  Zakarian, Mr. Mapriededer  male  26.5  7.225
1307       3        Zakarian, Mr. Ortin  male  27.0  7.225
1308       3         Zimmerman, Mr. Leo  male  29.0  7.875

np.float64(48.0)

In [488]:
titanic= pd.read_excel(r'C:\Users\IDEAL INFO\Documents\data_pipelines\titanic3.xls', usecols=['name', 'sex', 'age', 'pclass', 'fare']  )
titanic.head(10)

,pclass,name,sex,age,fare
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,211.3375
1,1,"Allison, Master. Hudson Trevor",male,0.9167,151.5500
2,1,"Allison, Miss. Helen Loraine",female,2.0000,151.5500
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,151.5500
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,151.5500
5,1,"Anderson, Mr. Harry",male,48.0000,26.5500
6,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,77.9583
7,1,"Andrews, Mr. Thomas Jr",male,39.0000,0.0000
8,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,51.4792
9,1,"Artagaveytia, Mr. Ramon",male,71.0000,49.5042

In [487]:
#5 represente the index , and 3 represente the column(age)
titanic.iloc[5,3]

np.float64(48.0)

In [490]:
#select the column aage for passengers 4,5 and 6 
titanic.iloc[[4,5,6],3]

4    25.0
5    48.0
6    63.0
Name: age, dtype: float64

In [ ]:
#select columns 0 , 1 and 2 for passenger 5 
titanic.iloc[5,[0,1,2]]

pclass                      1
name      Anderson, Mr. Harry
sex                      male
Name: 5, dtype: object

In [ ]:
#select column[0,1,2] for pssenger [4,5,6]

titanic.iloc[[4,5,6],[0,1,2]]

   pclass                                             name     sex
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
5       1                              Anderson, Mr. Harry    male
6       1                Andrews, Miss. Kornelia Theodosia  female

In [495]:
#select columns 0,1 and 2 for all passengers 
titanic.iloc[: , [0,1,2]]

      pclass                                             name     sex
0          1                    Allen, Miss. Elisabeth Walton  female
1          1                   Allison, Master. Hudson Trevor    male
2          1                     Allison, Miss. Helen Loraine  female
3          1             Allison, Mr. Hudson Joshua Creighton    male
4          1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
...      ...                                              ...     ...
1304       3                             Zabour, Miss. Hileni  female
1305       3                            Zabour, Miss. Thamine  female
1306       3                        Zakarian, Mr. Mapriededer    male
1307       3                              Zakarian, Mr. Ortin    male
1308       3                               Zimmerman, Mr. Leo    male

[1309 rows x 3 columns]

In [497]:
data1= pd.Series(data=[1,2,3])
data2= pd.Series(data=[2,3,4])
data1+data2

0    3
1    5
2    7
dtype: int64

In [ ]:
#in data1 we have only 3 values , so we going have a Nan value , otherwise the other values are going to be added accordingly 
data3= pd.Series(data=[10,20,30,40])
data1+data3

0    11.0
1    22.0
2    33.0
3     NaN
dtype: float64

In [499]:
#if we have 2 dataframes with same size , they're going to be very easy to combine them 
df1= pd.DataFrame(data={'a':[1,2],'b':[3,4]})
df2= pd.DataFrame(data={'a':[10,20],'b':[30,40]})

df1+df2

    a   b
0  11  33
1  22  44

In [ ]:
#if we dont have a same size for 2 dataframes, will still give us NaN for any operation performed with c 
#because it could not compute anything since our first dataset did not have a c column . 
df3= pd.DataFrame(data={'a':[100,200],'b':[300,400], 'c':[500,600] })
df1+df3

     a    b   c
0  101  303 NaN
1  202  404 NaN

In [501]:
cols=['name','survived','pclass','fare','age','sex']

In [502]:
titanic=pd.read_excel(r'C:\Users\IDEAL INFO\Documents\data_pipelines\titanic3.xls', index_col='name', usecols=cols)
titanic

,pclass,survived,sex,age,fare
name,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,211.3375
"Allison, Master. Hudson Trevor",1,1,male,0.9167,151.5500
"Allison, Miss. Helen Loraine",1,0,female,2.0000,151.5500
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.0000,151.5500
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.0000,151.5500
...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.5000,14.4542
"Zabour, Miss. Thamine",3,0,female,NaN,14.4542
"Zakarian, Mr. Mapriededer",3,0,male,26.5000,7.2250
"Zakarian, Mr. Ortin",3,0,male,27.0000,7.2250
"Zimmerman, Mr. Leo",3,0,male,29.0000,7.8750

In [ ]:
#let's filter all the males 
#if it's male , it's going to return True , else , False 
titanic['sex']=='male'

name
Allen, Miss. Elisabeth Walton                      False
Allison, Master. Hudson Trevor                      True
Allison, Miss. Helen Loraine                       False
Allison, Mr. Hudson Joshua Creighton                True
Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    False
                                                   ...
Zabour, Miss. Hileni                               False
Zabour, Miss. Thamine                              False
Zakarian, Mr. Mapriededer                           True
Zakarian, Mr. Ortin                                 True
Zimmerman, Mr. Leo                                  True
Name: sex, Length: 1309, dtype: bool

In [ ]:
#we're only going to get the males back from our dataframe because we said that we only want to get the elements back that are equal to male 
titanic[titanic['sex']=='male']

,pclass,survived,sex,age,fare
name,,,,,
"Allison, Master. Hudson Trevor",1,1,male,0.9167,151.5500
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.0000,151.5500
"Anderson, Mr. Harry",1,1,male,48.0000,26.5500
"Andrews, Mr. Thomas Jr",1,0,male,39.0000,0.0000
"Artagaveytia, Mr. Ramon",1,0,male,71.0000,49.5042
...,...,...,...,...,...
"Yousif, Mr. Wazli",3,0,male,NaN,7.2250
"Yousseff, Mr. Gerious",3,0,male,NaN,14.4583
"Zakarian, Mr. Mapriededer",3,0,male,26.5000,7.2250
"Zakarian, Mr. Ortin",3,0,male,27.0000,7.2250
"Zimmerman, Mr. Leo",3,0,male,29.0000,7.8750

In [ ]:
#check how many people were over the age of 65

#we're going to get all the people back that   are older than 65 years old 
age_mask= titanic['age']>65
titanic[age_mask]

,pclass,survived,sex,age,fare
name,,,,,
"Artagaveytia, Mr. Ramon",1,0,male,71.0,49.5042
"Barkworth, Mr. Algernon Henry Wilson",1,1,male,80.0,30.0000
"Cavendish, Mrs. Tyrell William (Julia Florence Siegel)",1,1,female,76.0,78.8500
"Crosby, Capt. Edward Gifford",1,0,male,70.0,71.0000
"Goldschmidt, Mr. George B",1,0,male,71.0,34.6542
"Straus, Mr. Isidor",1,0,male,67.0,221.7792
"Mitchell, Mr. Henry Michael",2,0,male,70.0,10.5000
"Wheadon, Mr. Edward H",2,0,male,66.0,10.5000
"Connors, Mr. Patrick",3,0,male,70.5,7.7500
"Svensson, Mr. Johan",3,0,male,74.0,7.7750

In [508]:
#selecting all te females that were in 1st class that also survived 
femal_mask= titanic['sex']== 'female'
first_class_mask=titanic['pclass']==1

titanic [femal_mask & first_class_mask]

,pclass,survived,sex,age,fare
name,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0,211.3375
"Allison, Miss. Helen Loraine",1,0,female,2.0,151.5500
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.0,151.5500
"Andrews, Miss. Kornelia Theodosia",1,1,female,63.0,77.9583
"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1,1,female,53.0,51.4792
...,...,...,...,...,...
"Wick, Mrs. George Dennick (Mary Hitchcock)",1,1,female,45.0,164.8667
"Widener, Mrs. George Dunton (Eleanor Elkins)",1,1,female,50.0,211.5000
"Willard, Miss. Constance",1,1,female,21.0,26.5500
"Wilson, Miss. Helen Alice",1,1,female,31.0,134.5000
"Young, Miss. Marie Grice",1,1,female,36.0,135.6333

In [ ]:
#selecting the richest kids on the titanic 
rich_kids_mask= (titanic['age']<21) & (titanic['fare']>200)
rich= titanic[rich_kids_mask]

rich.nlargest(n=5, columns=['age','fare'])

,pclass,survived,sex,age,fare
name,,,,,
"Fortune, Mr. Charles Alexander",1,0,male,19.0,263.0000
"Ryerson, Miss. Emily Borie",1,1,female,18.0,262.3750
"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",1,1,female,18.0,227.5250
"Madill, Miss. Georgette Alexandra",1,1,female,15.0,211.3375
"Ryerson, Master. John Borie",1,1,male,13.0,262.3750

In [510]:
#selecting all people that were under 21 or female that survived 
survived_mask= titanic['survived']==1
female_mask=titanic['sex']=='female'
age_mask = titanic['age']<=21

titanic[(female_mask|age_mask) & survived_mask  ]

,pclass,survived,sex,age,fare
name,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,211.3375
"Allison, Master. Hudson Trevor",1,1,male,0.9167,151.5500
"Andrews, Miss. Kornelia Theodosia",1,1,female,63.0000,77.9583
"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1,1,female,53.0000,51.4792
"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",1,1,female,18.0000,227.5250
...,...,...,...,...,...
"Turja, Miss. Anna Sofia",3,1,female,18.0000,9.8417
"Turkula, Mrs. (Hedwig)",3,1,female,63.0000,9.5875
"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",3,1,female,38.0000,7.2292
"Wilkes, Mrs. James (Ellen Needs)",3,1,female,47.0000,7.0000
"Yasbeck, Mrs. Antoni (Selini Alexander)",3,1,female,15.0000,14.4542

In [512]:
male_mask=titanic['sex']=='male'
titanic[male_mask]

,pclass,survived,sex,age,fare
name,,,,,
"Allison, Master. Hudson Trevor",1,1,male,0.9167,151.5500
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.0000,151.5500
"Anderson, Mr. Harry",1,1,male,48.0000,26.5500
"Andrews, Mr. Thomas Jr",1,0,male,39.0000,0.0000
"Artagaveytia, Mr. Ramon",1,0,male,71.0000,49.5042
...,...,...,...,...,...
"Yousif, Mr. Wazli",3,0,male,NaN,7.2250
"Yousseff, Mr. Gerious",3,0,male,NaN,14.4583
"Zakarian, Mr. Mapriededer",3,0,male,26.5000,7.2250
"Zakarian, Mr. Ortin",3,0,male,27.0000,7.2250
"Zimmerman, Mr. Leo",3,0,male,29.0000,7.8750

In [ ]:
#select all , when ages between 20 and 25 

upper_age_mask = titanic['age'] >=20
lower_age_mask =titanic['age']<=25 
titanic [upper_age_mask & lower_age_mask ]

,pclass,survived,sex,age,fare
name,,,,,
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.0,151.5500
"Aubart, Mme. Leontine Pauline",1,1,female,24.0,69.3000
"Baxter, Mr. Quigg Edmond",1,0,male,24.0,247.5208
"Birnbaum, Mr. Jakob",1,0,male,25.0,26.0000
"Bishop, Mr. Dickinson H",1,1,male,25.0,91.0792
...,...,...,...,...,...
"Vendel, Mr. Olof Edvin",3,0,male,20.0,7.8542
"Vovk, Mr. Janko",3,0,male,22.0,7.8958
"Waelens, Mr. Achille",3,0,male,22.0,9.0000
"Wiklund, Mr. Karl Johan",3,0,male,21.0,6.4958
"Windelov, Mr. Einar",3,0,male,21.0,7.2500

In [ ]:
#select all , when ages between 20 and 25  , and 20 é 25 are exclusive 
youth_mask=titanic['age'].between(20,25)
titanic[youth_mask]

,pclass,survived,sex,age,fare
name,,,,,
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.0,151.5500
"Aubart, Mme. Leontine Pauline",1,1,female,24.0,69.3000
"Baxter, Mr. Quigg Edmond",1,0,male,24.0,247.5208
"Birnbaum, Mr. Jakob",1,0,male,25.0,26.0000
"Bishop, Mr. Dickinson H",1,1,male,25.0,91.0792
...,...,...,...,...,...
"Vendel, Mr. Olof Edvin",3,0,male,20.0,7.8542
"Vovk, Mr. Janko",3,0,male,22.0,7.8958
"Waelens, Mr. Achille",3,0,male,22.0,9.0000
"Wiklund, Mr. Karl Johan",3,0,male,21.0,6.4958
"Windelov, Mr. Einar",3,0,male,21.0,7.2500

In [ ]:
#same reslt , but 20 and 25 are inclusive 
youth_mask=titanic['age'].between(20,25, inclusive='both')

titanic[youth_mask]

,pclass,survived,sex,age,fare
name,,,,,
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.0,151.5500
"Aubart, Mme. Leontine Pauline",1,1,female,24.0,69.3000
"Baxter, Mr. Quigg Edmond",1,0,male,24.0,247.5208
"Birnbaum, Mr. Jakob",1,0,male,25.0,26.0000
"Bishop, Mr. Dickinson H",1,1,male,25.0,91.0792
...,...,...,...,...,...
"Vendel, Mr. Olof Edvin",3,0,male,20.0,7.8542
"Vovk, Mr. Janko",3,0,male,22.0,7.8958
"Waelens, Mr. Achille",3,0,male,22.0,9.0000
"Wiklund, Mr. Karl Johan",3,0,male,21.0,6.4958
"Windelov, Mr. Einar",3,0,male,21.0,7.2500

In [ ]:
#let's select the passengers who  are in 1st and 2nd class 
first_mask= titanic['pclass']==1
second_mask = titanic ['pclass']==2

titanic[first_mask | second_mask   ]

,pclass,survived,sex,age,fare
name,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,211.3375
"Allison, Master. Hudson Trevor",1,1,male,0.9167,151.5500
"Allison, Miss. Helen Loraine",1,0,female,2.0000,151.5500
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.0000,151.5500
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.0000,151.5500
...,...,...,...,...,...
"Wheeler, Mr. Edwin ""Frederick""",2,0,male,NaN,12.8750
"Wilhelms, Mr. Charles",2,1,male,31.0000,13.0000
"Williams, Mr. Charles Eugene",2,1,male,NaN,13.0000
"Wright, Miss. Marion",2,1,female,26.0000,13.5000
"Yrois, Miss. Henriette (""Mrs Harbeck"")",2,0,female,24.0000,13.0000

In [ ]:
#check whether passengers are in the 1st or second class 
titanic['pclass'].isin([1,2])

name
Allen, Miss. Elisabeth Walton                       True
Allison, Master. Hudson Trevor                      True
Allison, Miss. Helen Loraine                        True
Allison, Mr. Hudson Joshua Creighton                True
Allison, Mrs. Hudson J C (Bessie Waldo Daniels)     True
                                                   ...
Zabour, Miss. Hileni                               False
Zabour, Miss. Thamine                              False
Zakarian, Mr. Mapriededer                          False
Zakarian, Mr. Ortin                                False
Zimmerman, Mr. Leo                                 False
Name: pclass, Length: 1309, dtype: bool

In [521]:
#how to find null values 
titanic['age'].isnull()

name
Allen, Miss. Elisabeth Walton                      False
Allison, Master. Hudson Trevor                     False
Allison, Miss. Helen Loraine                       False
Allison, Mr. Hudson Joshua Creighton               False
Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    False
                                                   ...
Zabour, Miss. Hileni                               False
Zabour, Miss. Thamine                               True
Zakarian, Mr. Mapriededer                          False
Zakarian, Mr. Ortin                                False
Zimmerman, Mr. Leo                                 False
Name: age, Length: 1309, dtype: bool

In [522]:
#how to find not null values 
titanic['age'].notnull()

name
Allen, Miss. Elisabeth Walton                       True
Allison, Master. Hudson Trevor                      True
Allison, Miss. Helen Loraine                        True
Allison, Mr. Hudson Joshua Creighton                True
Allison, Mrs. Hudson J C (Bessie Waldo Daniels)     True
                                                   ...
Zabour, Miss. Hileni                                True
Zabour, Miss. Thamine                              False
Zakarian, Mr. Mapriededer                           True
Zakarian, Mr. Ortin                                 True
Zimmerman, Mr. Leo                                  True
Name: age, Length: 1309, dtype: bool

In [523]:
cols=['name', 'survived', 'pclass', 'fare','age','sex']

In [ ]:
#importation of our database and we choice the columns 
titanic= pd.read_excel(r'C:\Users\IDEAL INFO\Documents\data_pipelines\titanic3.xls',index_col='name' ,usecols=cols)
titanic

,pclass,survived,sex,age,fare
name,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,211.3375
"Allison, Master. Hudson Trevor",1,1,male,0.9167,151.5500
"Allison, Miss. Helen Loraine",1,0,female,2.0000,151.5500
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.0000,151.5500
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.0000,151.5500
...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.5000,14.4542
"Zabour, Miss. Thamine",3,0,female,NaN,14.4542
"Zakarian, Mr. Mapriededer",3,0,male,26.5000,7.2250
"Zakarian, Mr. Ortin",3,0,male,27.0000,7.2250
"Zimmerman, Mr. Leo",3,0,male,29.0000,7.8750

In [ ]:
#renaming columns 
#get the columns names 
#they are of type object 

titanic.columns

Index(['pclass', 'survived', 'sex', 'age', 'fare'], dtype='object')

In [ ]:
#get the column name at the first position
titanic.columns[0]

'pclass'

In [ ]:
#one way to rename columns is to pass in a last of names of the same length 
titanic.columns =['Class', 'Survived', 'Gender', 'Age', 'Ticket price'] 
titanic

,Class,Survived,Gender,Age,Ticket price
name,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,211.3375
"Allison, Master. Hudson Trevor",1,1,male,0.9167,151.5500
"Allison, Miss. Helen Loraine",1,0,female,2.0000,151.5500
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.0000,151.5500
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.0000,151.5500
...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.5000,14.4542
"Zabour, Miss. Thamine",3,0,female,NaN,14.4542
"Zakarian, Mr. Mapriededer",3,0,male,26.5000,7.2250
"Zakarian, Mr. Ortin",3,0,male,27.0000,7.2250
"Zimmerman, Mr. Leo",3,0,male,29.0000,7.8750

In [ ]:
#to change a specific columns , we can use .rename 
#inplace=True : to make this operation permanent 

titanic.rename(columns={'Ticket price' : 'Fare'}, inplace=True)
titanic

,Class,Survived,Gender,Age,Fare
name,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,211.3375
"Allison, Master. Hudson Trevor",1,1,male,0.9167,151.5500
"Allison, Miss. Helen Loraine",1,0,female,2.0000,151.5500
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.0000,151.5500
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.0000,151.5500
...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.5000,14.4542
"Zabour, Miss. Thamine",3,0,female,NaN,14.4542
"Zakarian, Mr. Mapriededer",3,0,male,26.5000,7.2250
"Zakarian, Mr. Ortin",3,0,male,27.0000,7.2250
"Zimmerman, Mr. Leo",3,0,male,29.0000,7.8750

In [ ]:
#to specifiying an index name and a column name 

titanic.index.name='Index'
titanic.columns.name='Columns'
titanic

Columns,Class,Survived,Gender,Age,Fare
Index,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,211.3375
"Allison, Master. Hudson Trevor",1,1,male,0.9167,151.5500
"Allison, Miss. Helen Loraine",1,0,female,2.0000,151.5500
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.0000,151.5500
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.0000,151.5500
...,...,...,...,...,...
"Zabour, Miss. Hileni",3,0,female,14.5000,14.4542
"Zabour, Miss. Thamine",3,0,female,NaN,14.4542
"Zakarian, Mr. Mapriededer",3,0,male,26.5000,7.2250
"Zakarian, Mr. Ortin",3,0,male,27.0000,7.2250
"Zimmerman, Mr. Leo",3,0,male,29.0000,7.8750

In [ ]:
#filter out all the passengers which did not survive 
alive_mask= titanic['Survived']==1
titanic= titanic[alive_mask]
titanic

Columns,Class,Survived,Gender,Age,Fare
Index,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,211.3375
"Allison, Master. Hudson Trevor",1,1,male,0.9167,151.5500
"Anderson, Mr. Harry",1,1,male,48.0000,26.5500
"Andrews, Miss. Kornelia Theodosia",1,1,female,63.0000,77.9583
"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1,1,female,53.0000,51.4792
...,...,...,...,...,...
"Turkula, Mrs. (Hedwig)",3,1,female,63.0000,9.5875
"Vartanian, Mr. David",3,1,male,22.0000,7.2250
"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",3,1,female,38.0000,7.2292
"Wilkes, Mrs. James (Ellen Needs)",3,1,female,47.0000,7.0000
"Yasbeck, Mrs. Antoni (Selini Alexander)",3,1,female,15.0000,14.4542

In [540]:
#what is the max Fare in 3rd class ?
third_mask=titanic['Class']==3
titanic.loc [third_mask,'Fare'].max()

np.float64(56.4958)

In [541]:
#rename the index of 'name' to passenger
titanic.index.name='Passenger'
titanic

Columns,Class,Survived,Gender,Age,Fare
Passenger,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,211.3375
"Allison, Master. Hudson Trevor",1,1,male,0.9167,151.5500
"Anderson, Mr. Harry",1,1,male,48.0000,26.5500
"Andrews, Miss. Kornelia Theodosia",1,1,female,63.0000,77.9583
"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1,1,female,53.0000,51.4792
...,...,...,...,...,...
"Turkula, Mrs. (Hedwig)",3,1,female,63.0000,9.5875
"Vartanian, Mr. David",3,1,male,22.0000,7.2250
"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",3,1,female,38.0000,7.2292
"Wilkes, Mrs. James (Ellen Needs)",3,1,female,47.0000,7.0000
"Yasbeck, Mrs. Antoni (Selini Alexander)",3,1,female,15.0000,14.4542

In [ ]:
#create a new column that's called Free_Coffee , insert 1 if a passenger is either in 1st or 2nd class , otherwise isert 0 
coffe_mask= titanic['Class'].isin([1,2])
titanic['Free_Coffee']=0
titanic.loc[coffe_mask, 'Free_Coffee']=1
titanic

C:\Users\IDEAL INFO\AppData\Local\Temp\ipykernel_22260\4258064855.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic['Free_Coffee']=0

Columns,Class,Survived,Gender,Age,Fare,Free_Coffee
Passenger,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,211.3375,1
"Allison, Master. Hudson Trevor",1,1,male,0.9167,151.5500,1
"Anderson, Mr. Harry",1,1,male,48.0000,26.5500,1
"Andrews, Miss. Kornelia Theodosia",1,1,female,63.0000,77.9583,1
"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1,1,female,53.0000,51.4792,1
...,...,...,...,...,...,...
"Turkula, Mrs. (Hedwig)",3,1,female,63.0000,9.5875,0
"Vartanian, Mr. David",3,1,male,22.0000,7.2250,0
"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",3,1,female,38.0000,7.2292,0
"Wilkes, Mrs. James (Ellen Needs)",3,1,female,47.0000,7.0000,0
"Yasbeck, Mrs. Antoni (Selini Alexander)",3,1,female,15.0000,14.4542,0

In [549]:
#use value.count() to verify that 3rd class doesn't get any free coffee
titanic.loc[:,['Free_Coffee','Class']].value_counts()

Free_Coffee  Class
1            1        200
0            3        181
1            2        119
Name: count, dtype: int64

In [ ]:
#import new db .csv
pokemons= pd.read_csv(r'C:\Users\IDEAL INFO\Documents\data_pipelines\Pokemon.csv', index_col='#')
pokemons

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [551]:
pokemons.info()

<class 'pandas.core.frame.DataFrame'>
Index: 800 entries, 1 to 721
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        800 non-null    object
 1   Type 1      800 non-null    object
 2   Type 2      414 non-null    object
 3   Total       800 non-null    int64
 4   HP          800 non-null    int64
 5   Attack      800 non-null    int64
 6   Defense     800 non-null    int64
 7   Sp. Atk     800 non-null    int64
 8   Sp. Def     800 non-null    int64
 9   Speed       800 non-null    int64
 10  Generation  800 non-null    int64
 11  Legendary   800 non-null    bool
dtypes: bool(1), int64(8), object(3)
memory usage: 75.8+ KB

In [552]:
pokemons.describe().round()

       Total     HP  Attack  Defense  Sp. Atk  Sp. Def  Speed  Generation
count  800.0  800.0   800.0    800.0    800.0    800.0  800.0       800.0
mean   435.0   69.0    79.0     74.0     73.0     72.0   68.0         3.0
std    120.0   26.0    32.0     31.0     33.0     28.0   29.0         2.0
min    180.0    1.0     5.0      5.0     10.0     20.0    5.0         1.0
25%    330.0   50.0    55.0     50.0     50.0     50.0   45.0         2.0
50%    450.0   65.0    75.0     70.0     65.0     70.0   65.0         3.0
75%    515.0   80.0   100.0     90.0     95.0     90.0   90.0         5.0
max    780.0  255.0   190.0    230.0    194.0    230.0  180.0         6.0

In [553]:
pokemons.describe(exclude=['int','float'])

             Name Type 1  Type 2 Legendary
count         800    800     414       800
unique        800     18      18         2
top     Bulbasaur  Water  Flying     False
freq            1    112      97       735

In [ ]:
#i want to understand how many characters each name contains 
pokemons['name_length']= pokemons['Name'].apply(len)
pokemons

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,name_length
#,,,,,,,,,,,,,
1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False,9
2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False,7
3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False,8
3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False,21
4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...
719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True,7
719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True,19
720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True,19
720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True,18
721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True,9

In [ ]:
#delete the name_length column
#error because i run the code before show th rslt , so the solution is correct 
del pokemons['name_length']
pokemons

KeyError: 'name_length'

In [558]:
pokemons

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [ ]:
#wreate a function named it strength 
def strength (attack:int)-> str:
    if attack >150:
        return 'Strong'
    elif attack > 100:
        return 'Average'
    else:
        return 'Weak'

In [ ]:
#create a new column containe the rslt of the function strength 
pokemons['strength']= pokemons['Attack'].apply(strength)
pokemons

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,strength
#,,,,,,,,,,,,,
1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False,Weak
2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False,Weak
3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False,Weak
3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False,Weak
4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False,Weak
...,...,...,...,...,...,...,...,...,...,...,...,...,...
719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True,Weak
719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True,Strong
720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True,Average
720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True,Strong
721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True,Average